[
    {
        "questionId": "BF706651-4BE8-479C-AC3F-3EEAA533A716",
        "questionText": "What option(s) are required criteria for a service to be a cloud service?",
        "explanation": "Five specific criteria are required for a service to be a cloud service:\n\n\t\n\t\tOn-demand self-service: You determine when you want and do not want a service.\n\t\n\t\tBroad network access: The cloud service must be accessible by numerous connectivity options and a fast number of devices should be able to leverage it.\n\t\n\t\tResource pooling: Instead of assigning dedicated resources, such as memory and CPU, to each system, resources can be shared across a set of services, servers, and systems. These shared resources are then dynamically allocated on-demand as a system needs it.\n\t\n\t\tRapid elasticity: A cloud service is very different from an on-premise virtual environment. There are still capabilities like resource pooling on-premise, but with rapid elasticity it&rsquo;s hard to come by. Rapid elasticity makes the pools of resources seem unlimited. New resource requests are completed rapidly.\n\t\n\t\tMeasured service: In a cloud service, utilization is tracked and monitored, which can then be reported on by the operator. This is used for billing but also can be used for other capabilities if needed by an organization.\n\n\n\tBoth agile network access and proactive service are unrelated to a cloud service offering and refer to business architecture principals.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Broad network access",
                "IsCorrect": true
            },
            {
                "Text": "Resource pooling",
                "IsCorrect": true
            },
            {
                "Text": "Agile network access",
                "IsCorrect": false
            },
            {
                "Text": "Proactive service",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "08802FE9-23D3-4FFA-9D01-431F5B3D31A2",
        "questionText": "Which cloud service is specific to one company that owns both the tools/infrastructure that creates the cloud and employs the people that use the services?",
        "explanation": "A private cloud is defined as a service that is private to a single company that owns and operates the infrastructure and employs the people that will be requesting and using the services offered. A public cloud, on the other hand, is a service that is owned and operated by a third party, but with the people that request and use the service being employees of a number of different companies that choose to use the service.",
        "difficulty": "1",
        "comments": "<p>\n\t2/1 - query to Au re: semantics</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Hybrid cloud",
                "IsCorrect": false
            },
            {
                "Text": "Public cloud",
                "IsCorrect": false
            },
            {
                "Text": "Private cloud",
                "IsCorrect": true
            },
            {
                "Text": "Internal cloud",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "A22CB2E0-B343-47AE-8CB6-53645F91A952",
        "questionText": "Which of the following options are available to configure the Cisco 8000V router and provide access to the CLI via a hypervisor?",
        "explanation": "There are two options to connect to the console of a Cisco 8000V virtual router inside a hypervisor: virtual console access via the virtual VGA console within the hypervisor, and serial console access, which is available via the UNIX xTerm terminal. The other two options are incorrectly listed.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Serial console via the virtual VGA console",
                "IsCorrect": false
            },
            {
                "Text": "Virtual console via the virtual VGA console",
                "IsCorrect": true
            },
            {
                "Text": "Virtual console via the UNIX xTerm terminal",
                "IsCorrect": false
            },
            {
                "Text": "Serial console via the UNIX xTerm terminal",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "A7859D36-BEE8-46FA-90C9-583F515799E1",
        "questionText": "Which cloud service model provides access to an application that is built, monitored, and offered by the cloud provider?",
        "explanation": "Software as a Service (SaaS) is likely one of the most publicly used services on the modern Internet. Common examples include iCloud, Google Drive, Dropbox, Office 365, and many more. When using a SaaS, the customer doesn&rsquo;t need to deal with any hardware or software issues that come up as part of the host system; they only need to handle issues related to the specific service being provided.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "TaaS",
                "IsCorrect": false
            },
            {
                "Text": "IaaS",
                "IsCorrect": false
            },
            {
                "Text": "PaaS",
                "IsCorrect": false
            },
            {
                "Text": "SaaS",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "B883C1CE-A875-4B2B-AE30-5D4A107792F6",
        "questionText": "Which option is not one of the most commonly deployed virtualization vendors and products?",
        "explanation": "Four of the most commonly deployed virtualization products include Microsoft Hyper-V, VMware vCenter, Citrix Hypervisor (formerly XenServer),&nbsp;and Red Hat Kernel-based Virtual Machine (KVM). Oracle does create hypervisors, including Oracle VM, but not under the name Oracle vCenter.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Oracle KVM",
                "IsCorrect": true
            },
            {
                "Text": "Microsoft Hyper-V",
                "IsCorrect": false
            },
            {
                "Text": "VMware vCenter",
                "IsCorrect": false
            },
            {
                "Text": "Red Hat KVM",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "F925A4B9-B7CA-4D90-87C4-614DCD8C902E",
        "questionText": "Regarding containers used in server virtualization, which of the following answers lists a software component not typically included in the container?",
        "explanation": "A software container relies on an environment that supplies a running Operating System (OS) that includes support for software containers. The container image (the multi-file container as stored on disk) holds the application executable files and any other files the application needs besides those included with the OS. A container may consist of files with application settings and software libraries not included as a standard part of the OS.",
        "difficulty": "3",
        "comments": "<p>Formerly&nbsp;200301-WO-v2-2-app-009 from 2023 Exam Updates question batch.</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "An application",
                "IsCorrect": false
            },
            {
                "Text": "Application settings files",
                "IsCorrect": false
            },
            {
                "Text": "Software Libraries",
                "IsCorrect": false
            },
            {
                "Text": "A base operating system (e.g., Linux)",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "23C51457-AF1D-412B-8922-6536520775C4",
        "questionText": "Each virtual OS instance that exists on a server is referred to as a ___________",
        "explanation": "In virtualization a virtual machine (VM) is a single instance of an operating system (OS).",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "KVM",
                "IsCorrect": false
            },
            {
                "Text": "VM",
                "IsCorrect": true
            },
            {
                "Text": "CSR",
                "IsCorrect": false
            },
            {
                "Text": "hypervisor",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "1F7D138F-F605-4A1E-B2B1-71554C51D24F",
        "questionText": "Which cloud service model is primarily targeted toward the software development community and provides the ability to not only customize the hardware being virtualized but also offer different development tools and utilities that are commonly used for a specific environment?",
        "explanation": "Platform as a Service (PaaS) is a very popular cloud offering as it provides for a dynamic environment that can be used by developers to both code and test their specific solutions. A common problem before PaaS was that developers had to build specific hardware/software environments that would be used to emulate each specific customer demographic to ensure that their solutions would work correctly. With PaaS, now these environments can be quickly created and be used to test solutions much more efficiently.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "TaaS",
                "IsCorrect": false
            },
            {
                "Text": "IaaS",
                "IsCorrect": false
            },
            {
                "Text": "SaaS",
                "IsCorrect": false
            },
            {
                "Text": "PaaS",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "AAE80F2F-09DF-40DC-96AC-78BA45678FEB",
        "questionText": "A data center runs some virtual machines (VMs) and some containers. Think about the concept of a VM image as stored on disk, a running VM once it has been started, a container image as stored on disk, and a running container once it has been started. Which answers accurately compare and contrast VMs and containers? (Choose two answers.)",
        "explanation": "Virtual Machines (VMs) rely on a virtualization system with a hypervisor. The VM includes an installed OS, so starting a VLM includes initializing (booting) the OS. That process relies on the usual computer components: CPU, RAM, disk, and network. The hypervisor virtualizes those computer resources so the VM can be initialized and run.\n\nA container image does not include an OS and does not rely on a virtualization system or hypervisor. Instead, it depends on an OS with container support and a container engine. The container image includes all software components needed to run an application besides the OS. The container engine enables the management of starting and stopping containers.\n\nAs for the answers, VMs use a hypervisor, while containers do not, instead using a container engine. Also, initializing a VM includes booting an OS, so starting a VM may take several minutes. Starting a container takes seconds, more like the time taken to start an application.",
        "difficulty": "3",
        "comments": "<p>Formerly&nbsp;200301-WO-v2-1-app-009 from the 2023 Exam Updates question batch.</p>\n\n<p>Inline exhibit</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "VMs typically take more time to initialize than containers.",
                "IsCorrect": true
            },
            {
                "Text": "Container images typically take more space on disk than VM images.",
                "IsCorrect": false
            },
            {
                "Text": "Containers require a hypervisor to create a working environment.",
                "IsCorrect": false
            },
            {
                "Text": "VMs require a hypervisor to create a working environment.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "DC0320AD-8249-4E91-BF01-9155CA62E5E3",
        "questionText": "What is the name of the Cisco product that offers a number of rack-mountable server configurations intended to be used in data centers?",
        "explanation": "A few years ago Cisco got into the server hardware market with its Unified Computing System (UCS) that offers a number of different server configuration options that are intended to compete directly with existing server hardware providers.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "ASA",
                "IsCorrect": false
            },
            {
                "Text": "KVM",
                "IsCorrect": false
            },
            {
                "Text": "CRC",
                "IsCorrect": false
            },
            {
                "Text": "UCS",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "B7434AE3-7AD8-4A83-9EA7-9C49C43A53EF",
        "questionText": "Which cloud service is owned and operated by a third party and allows people from a variety of different companies to request and use its resources?",
        "explanation": "A private cloud is defined as a service that is private to a single company that owns and operates the infrastructure and includes the people that will be requesting and using the services offered. A public cloud, on the other hand, is a service that is owned and operated by a third party and the people that request and use the service can be from a number of different companies.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Hybrid cloud",
                "IsCorrect": false
            },
            {
                "Text": "Internet cloud",
                "IsCorrect": false
            },
            {
                "Text": "Private cloud",
                "IsCorrect": false
            },
            {
                "Text": "Public cloud",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "EDDE746B-E821-41D1-8EB1-A4C6B162FF2C",
        "questionText": "In the virtualization world, the ___________ manages and allocates the host hardware for each VM.",
        "explanation": "In the virtualization world, a hypervisor is used to manage and allocate resources from the host hardware as dictated by the settings of any virtual machines (VM).",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Host controller",
                "IsCorrect": false
            },
            {
                "Text": "Hyperthreader",
                "IsCorrect": false
            },
            {
                "Text": "Hypervisor",
                "IsCorrect": true
            },
            {
                "Text": "Host service",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "E22CB833-D270-4D4A-AB34-A5B91F66AA5B",
        "questionText": "Which cloud service model gives a customer complete control over the virtual hardware components, including processor performance, network connectivity, how much memory and storage space is required, and potentially the operating system that is preinstalled?",
        "explanation": "Infrastructure as a Service (IaaS) is one of the easiest-to-understand service models because it is the easiest to relate from physical devices. When utilizing an IaaS service, you specify all of the requirements of the virtual hardware as well as potentially the operating system that can be preinstalled; this is built and network connectivity is provisioned so that access to the service is completed within a very short amount of time.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "SaaS",
                "IsCorrect": false
            },
            {
                "Text": "IaaS",
                "IsCorrect": true
            },
            {
                "Text": "PaaS",
                "IsCorrect": false
            },
            {
                "Text": "TaaS",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "D96CFA63-CD60-410A-8CC9-0524F77D9708",
        "questionText": "Which answers describe how automation impacts network management?",
        "explanation": "&nbsp;\n\n\tThe following are the most common benefits of how automation impacts network management:\n\n\t\n\t\tThe use of APIs and data models makes managing a network easier and quicker.\n\t\n\t\tThe use of data and controllers makes it possible to automate functions that were not easily automated before.\n\t\n\t\tIt simplifies operations, resulting in more consistent configuration and fewer errors.\n\t\n\t\tThe ability to have data analytics provides real-time information that can be used to make decisions.\n\t\n\t\tFaster timelines to implement new projects means more tasks can be completed at a faster rate because of automation.\n\t\n\t\tYou can use internal and external input to make more accurate decisions, like time of day and resource loads.\n\n\n\tThe incorrect answers happen to describe opposite effects from automation rather than the actual effects.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The use of APIs and data models makes managing a network easier and quicker.",
                "IsCorrect": true
            },
            {
                "Text": "The use of data and controllers makes it possible to automate functions that were not easily automated before.",
                "IsCorrect": true
            },
            {
                "Text": "The use of automation slows the timeline for implementing new projects.",
                "IsCorrect": false
            },
            {
                "Text": "The increase in complexity of operations from automation results in a less consistent configuration and more errors in the network.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "B25652B9-1B91-4350-BA42-0DA789EA681F",
        "questionText": "What is the name of the protocol that has been developed by the ONF that is used to communicate between an SDN controller and the network devices it controls?",
        "explanation": "The first Southbound Interface that was developed for SDN was OpenFlow; it is controlled by the Open Networking Foundation (ONF). It defines a method of communication between the SDN controller and the switches that it will control.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "OpFlex",
                "IsCorrect": false
            },
            {
                "Text": "OpenSDN",
                "IsCorrect": false
            },
            {
                "Text": "SbControl",
                "IsCorrect": false
            },
            {
                "Text": "OpenFlow",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "FA04B2E7-B8A8-4629-ADA6-2528578C024A",
        "questionText": "Which protocol(s) does configuration management tools typically use to automate traditional configuration processes?",
        "explanation": "There are two correct answers here. Both the NETCONF and RESTCONF protocols are used by typical configuration management tools. BGP and EIGRP are Layer 3 routing protocols and are not used for automation of configuration processes.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "EIGRP",
                "IsCorrect": false
            },
            {
                "Text": "NETCONF",
                "IsCorrect": true
            },
            {
                "Text": "BGP",
                "IsCorrect": false
            },
            {
                "Text": "RESTCONF",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "621C0E4F-FD3B-48E0-91CF-4A688875A3CE",
        "questionText": "When comparing controller-based networks and traditional networks what are some perceived benefits from a controller-based perspective?",
        "explanation": "The following are the most common benefits when comparing controller-based networks with traditional networks from a controller-based perspective:\n\n\t\n\t\tNew operational models that allow for the entire network to be instantiated, and not just a single device at a time\n\t\n\t\tThe use of automation through APIs that enable data driven models\n\t\n\t\tThe use of APIs to mass-configure network devices, allowing for more consistency and less errors\n\t\n\t\tThe use of DevOps approaches in the network to increase efficiency and productivity\n\n\n\tThe other answers, new operational models that allow for a single device to be instantiated with the entire network in mind and the use of legacy approaches in the network to increase efficiency and productivity, are actually the opposite benefits of a controller-based network.\n\t&nbsp;",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "New operational models that allow the entire network to be instantiated and not just a single device at a time",
                "IsCorrect": true
            },
            {
                "Text": "The use of automation through APIs that enable data-driven models",
                "IsCorrect": true
            },
            {
                "Text": "New operational models that allow for a single device to be instantiated with the entire network in mind",
                "IsCorrect": false
            },
            {
                "Text": "The use of legacy approaches in the network to increase efficiency and productivity",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "994CC402-9261-4F18-B480-4F6380B37506",
        "questionText": "What are some perceived benefits of controller-based networks as compared to traditional networks?",
        "explanation": "The following are the most common benefits of controller-based networks compared to traditional networks:\n\n\t\n\t\tNew operational models that allow for the entire network to be instantiated, and not just a single device at a time\n\t\n\t\tThe use of automation through APIs that enable data-driven models\n\t\n\t\tThe use of APIs to mass-configure network devices, allowing for more consistency and fewer errors\n\t\n\t\tThe use of DevOps approaches in the network to increase efficiency and productivity\n\n\n\tThe other answers, new operational models that allow for a single device to be instantiated with the entire network in mind and the use of legacy approaches in the network to increase efficiency and productivity, are actually the opposite of the benefits when comparing controller-based networks with transitional (legacy) networks.\n\t&nbsp;",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "New operational models that allow for a single device to be instantiated with the entire network in mind",
                "IsCorrect": false
            },
            {
                "Text": "The use of APIs to mass-configure network devices, allowing for more consistency and fewer errors",
                "IsCorrect": true
            },
            {
                "Text": "The use of DevOps approaches in the network to increase efficiency and productivity",
                "IsCorrect": true
            },
            {
                "Text": "The use of legacy approaches in the network to increase efficiency and productivity",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "6ED8D081-27BA-41AF-A86C-8B41622B1818",
        "questionText": "Where does the majority of the switching logic occur on a Cisco switch?",
        "explanation": "An application-specific integrated circuit (ASIC) is a purpose-built chip that is able to perform message processing at a consistently high rate that is well able what is capable of a switches central processor.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "CPU",
                "IsCorrect": false
            },
            {
                "Text": "Distributed controller",
                "IsCorrect": false
            },
            {
                "Text": "ASIC",
                "IsCorrect": true
            },
            {
                "Text": "CEF",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "5CFD39F1-DBB0-4953-AC5E-FCABAE2EFE37",
        "questionText": "Which answers describe how automation impacts network management?",
        "explanation": "The following are the most common benefits of how automation impacts network management:\n\n\t\n\t\tThe use of APIs and data models make managing a network easier and quicker\n\t\n\t\tThe use of data and controllers makes it possible to automate functions that were not easily automated before\n\t\n\t\tSimplified operations result in more consistent configuration and fewer errors\n\t\n\t\tThe capability to have data analytics that provides real-time information that can be used to make decisions\n\t\n\t\tFaster timelines to implement new projects, which means more tasks can be completed at a faster rate\n\t\n\t\tThe use of internal and external input to make more accurate decisions, like time of day and resource loads\n\n\n\tThe other answers are actually the opposite of the impact automation has on network management.\n\t&nbsp;",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The use of automation slows the timeline for implementing new projects",
                "IsCorrect": false
            },
            {
                "Text": "Simplified operations result in more consistent configuration and fewer errors",
                "IsCorrect": true
            },
            {
                "Text": "Increase in complexity of operations from automation resulting in a less consistent configuration and more errors in the network",
                "IsCorrect": false
            },
            {
                "Text": "The ability to have data analytics that provides real-time information that can be used to make decisions",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "26F92333-6097-420E-85BC-26975A4BE4A0",
        "questionText": "When planning a greenfield Cisco SD-Access design, what traditional LAN design points should be included?",
        "explanation": "&nbsp;\n\nWhen planning a greenfield Cisco SD-Access design, the traditional LAN design points are\n\n\n\tThe number of switchports needed in each switch\n\tThe required speed of the switchports\n\tThe benefits of a switch stack in each location\n\tThe current cable lengths and types already used\n\tThe requirement to support power to endpoint devices\n\tThe current power available in each new switch\n\tLink capacity for links between switches\n\n\nFor the incorrect options, a security firewall to properly segment traffic is actually something that does not help within the LAN portion of Cisco SD-Access.\nAlso, note that neither the underlay or overlay requires the use of Spanning Tree, so the STP mode need not be consisered.",
        "difficulty": "3",
        "comments": "<p>4/3/24 Updated SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The number of switchports needed in each switch",
                "IsCorrect": true
            },
            {
                "Text": "The required speed of the switchports",
                "IsCorrect": true
            },
            {
                "Text": "A security firewall to properly segment traffic",
                "IsCorrect": false
            },
            {
                "Text": "The Spanning Tree mode of operation to use",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "42F7F744-E4B4-426B-8A67-27675B43B43D",
        "questionText": "Which topology in the figure implies a valid Cisco SD-Access routed access layer design?\n\n&nbsp;",
        "explanation": "The features of a routed access layer design are:\n\n\t\n\t\tAll switches act as layer 3 switches\n\t\n\t\tAll switches use an IGP\n\t\n\t\tAll links between switches operate as layer 3 links instead of layer 2 links with trunking.\n\t\n\t\tNo VLANs extend beyond a single switch so Spanning Tree Protocol is not needed.\n\t\n\t\tEndpoints use an IP address on their directly-connected switch as their&nbsp;default gateway.\n\t\n\t\tA First Hop Redundancy Protocol (FHRP) is no longer needed.\n\n\n\tOf the three topologies, only topology A shows all layer 3 links between switches.",
        "difficulty": "4",
        "comments": "<p>4/3/24 Updated SDA to Cisco SD-Access and marked A as the correct answer as it wasn&#39;t listed. -JG</p>\n",
        "exhibits": [
            {
                "ExhibitId": "B7C1017C-0958-4BDE-BF03-055C90C925B8",
                "ExhibitTitle": "1",
                "ExhibitFileName": "https://builder.pearsonitcertification.com/Content/Exhibits/B7C1017C-0958-4BDE-BF03-055C90C925B8/200301-zz-v2-3-17-11.jpg"
            }
        ],
        "answerChoices": [
            {
                "Text": "Topology A",
                "IsCorrect": true
            },
            {
                "Text": "Topology B",
                "IsCorrect": false
            },
            {
                "Text": "Topology C",
                "IsCorrect": false
            },
            {
                "Text": "None",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "46CE826C-B330-48F0-9AA2-2D8697771E34",
        "questionText": "What should not be done when deploying Cisco SD-Access in a brownfield environment?",
        "explanation": "When deploying Cisco SD-Access in a brownfield environment, there will be live production traffic that you won&rsquo;t want to interrupt or harm during the deployment of Cisco SD-Access. Because of this, Cisco Catalyst Center should not be leveraged to build out the underlay. In a greenfield situation with Cisco SD-Access, you can use Cisco Catalyst Center to automatically build out the underlay.\n\nWith a brownfield deployment of Cisco SD-Access, it is critical to make sure that all the devices, new and old, are listed on the Cisco SD-Access compatibility list. In addition, you must make sure your devices are running software levels that are also defined on the compatibility list. Failure to follow the compatibility list can result in future outages or uncertain behavior.",
        "difficulty": "3",
        "comments": "<p>12/29 - disregard Au query</p>\n\n<p>&nbsp;</p>\n\n<p>4/3/24 Updated SDA to Cisco SD-Access and DNA Center to Cisco Catalyst Center -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Using Cisco Catalyst Center to automatically configure the underlay.",
                "IsCorrect": true
            },
            {
                "Text": "Choosing any Cisco switch that supports RSTP.",
                "IsCorrect": true
            },
            {
                "Text": "Choosing switches that are listed on the hardware compatibility list.",
                "IsCorrect": false
            },
            {
                "Text": "Configuring the underlay without Cisco Catalyst Center (that is, manually).",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "D2DB8405-1463-4146-AF1D-3AE58C8C52D6",
        "questionText": "The Cisco SD-Access design for the access layer is actually a well-known design called a routed access layer design. What are the features of a routed access layer design?",
        "explanation": "&nbsp;\n\n\tThe features of a routed access layer design are\n\n\t\n\t\tAll switches act as Layer 3 switches.\n\t\n\t\tAll switches use an IGP.\n\t\n\t\tAll links between switches act as Layer 3 routed links, not Layer 2 links spanning VLANs.\n\t\n\t\tBecause no layer 2 links exist between the switches, switches do not need to use Spanning tree.\n\t\n\t\tEndpoints refer to a default gateway IP address of an interface on the layer 3 switch directly connected to the endpoint device.\n\t\n\t\tA First Hop Redundancy Protocol (FHRP) is no longer needed.\n\n\n\tAs for the incorrect answers, a routed access layer design keeps all VLANs within one switch, with no layer 2 trunks, and therefore no Layer 2 loops possible - removing the need for STP. Most switches enable STP by default but in this architecture they are not required and could be turned off.\n\n\t&nbsp;",
        "difficulty": "2",
        "comments": "<p>4/3/24 Updated SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "All links between switches are Layer 2, spanning VLANs.",
                "IsCorrect": false
            },
            {
                "Text": "All links between switches are Layer 3, not Layer 2 links spanning VLANs.",
                "IsCorrect": true
            },
            {
                "Text": "Spanning tree is needed because Layer 2 is spanned.",
                "IsCorrect": false
            },
            {
                "Text": "Spanning tree is not needed because Layer 2 is not being spanned.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "C6AEDE5D-70D3-45F7-976A-3F96C0F4C4F1",
        "questionText": "In a Cisco SD-Access overlay network, what is the first step in the sequence of delivering a frame across the network?",
        "explanation": "The first fabric edge node to receive the frame encapsulates the frame in a new message using VXLAN and forwards the frame into the fabric. Once the ingress fabric edge node has encapsulated the original frame in VXLAN, the other fabric nodes forward the frame based on the VXLAN tunnel details. The last fabric edge node in the path removes the VXLAN details, which leaves the original frame and then forwards the original frame toward the destination endpoint.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "An endpoint sends the frame to a fabric edge node.",
                "IsCorrect": true
            },
            {
                "Text": "Other fabric nodes forward the frame based on VXLAN tunnel details.",
                "IsCorrect": false
            },
            {
                "Text": "The fabric edge node removes VXLAN details.",
                "IsCorrect": false
            },
            {
                "Text": "The fabric edge node encapsulates the frame in VXLAN.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "5EE56CED-A243-4F15-8688-3FCC30F62005",
        "questionText": "What are some benefits of a Cisco SD-Access group-based security model?",
        "explanation": "&nbsp;\n\nWith legacy ACLs and how we as an industry have managed them over the years, there are a lot of inherent management nightmares. For example, ACEs could not be removed because of the potential risk of failure to the entire ACL. New changes add to the current ACL, which ends up being more complicated the longer it gets.\n\nCisco SD-Access instead uses group-based security with SGTs. Instead of hard coding a security rule in a list like an ACL, you can identify who and what something is, assign a value to it, and then look up that value in a grid or matrix to validate what the user should and shouldn&rsquo;t be doing. With this new model, there are some huge benefits:\n\n\n\tEach new security requirement can be considered separately from the existing policies.\n\tCisco SD-Access (through Cisco Catalyst Center) keeps the security policies clear as a grid of security groups and their allowed access\n\tAs a result, each policy can be removed without affecting another policy.\n\tThe user interface includes note-taking space to&nbsp;track why a policy was created.\n\tThere is proper logging of when the policy is being used and by whom, and when the policy was last used.\n\n\nFor the incorrect answers, first, note that the user interface in Cisco Catalyst Center shows the SGT access policies as a grid, rather than showing the matching logic as compiled into an integrated whole, making it much easier to work with the policies. You can add new SGTs, and set their access rights (permit, deny), without considering any changes to the existing parts of the table.",
        "difficulty": "3",
        "comments": "<p>4/3/24 Updated SDA to Cisco SD-Access and DNC Center to Cisco Catalyst Center -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The security model as seen by engineers combines policies after configuration.",
                "IsCorrect": false
            },
            {
                "Text": "Each new security requirement can be considered separately from existing policies.",
                "IsCorrect": true
            },
            {
                "Text": "Each new security requirement must consider all endpoints and existing security policies.",
                "IsCorrect": false
            },
            {
                "Text": "Each policy can be removed without fear of impacting another policy.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "E638F955-0F3D-4AE9-8263-877AB8F56A49",
        "questionText": "The Cisco SD-Access underlay uses a well-known design called a routed access layer design. What are the features of a routed access layer design?",
        "explanation": "&nbsp;\n\n\tThe features of a routed access layer design are\n\n\t\n\t\tAll switches act as Layer 3 switches.\n\t\n\t\tAll switches use an IGP.\n\t\n\t\tAll links between switches act as Layer 3 routed links, not Layer 2 links spanning VLANs.\n\t\n\t\tBecause no layer 2 links exist between the switches, switches do not need to use Spanning tree.\n\t\n\t\tEndpoints refer to a default gateway IP address of an interface on the layer 3 switch directly connected to the endpoint device.\n\t\n\t\tA First Hop Redundancy Protocol (FHRP) is no longer needed.\n\n\n\tAs for the incorrect answers, the border node is not the default gateway for any of the endpoint devices in the fabric. The edge node the endpoint device is connected to is the default gateway. Because of this, there is no need to run an FHRP anymore.\n\t&nbsp;",
        "difficulty": "3",
        "comments": "<p>&nbsp;</p>\n\n<p>12/20 -&quot;The short version is that for SDA, any IGP can be used. That mention of IS-IS on page 389 of Volume 2 is in the context of the paragraph that precedes the list, which discusses a greenfield deployment. In that case, DNA-C can choose its preferred features and configuration to create the underlay, which uses IS-IS as the IGP. A brownfield deployment, which means that you begin with a working campus LAN and improve it to support SDA, can use any IGP. So, the more general requirement is IP connectivity, with a preference for using IS-IS if starting from scratch (aka Greenfield.) &quot;</p>\n\n<p>12/1 - query to Au</p>\n\n<p>12/13 - ok as-is, 11/27 - query to Au</p>\n\n<p>4/3/24 Updated SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The border node is the default gateway for all endpoint devices.",
                "IsCorrect": false
            },
            {
                "Text": "FHRP is required for default gateway redundancy and is deployed on the border node.",
                "IsCorrect": false
            },
            {
                "Text": "The switch to which an endpoint device physically connects is that device&rsquo;s default gateway.",
                "IsCorrect": true
            },
            {
                "Text": "FHRP is no longer needed.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "E96236C8-4646-433E-97B8-A92AF0C8CC1A",
        "questionText": "This Cisco SD-Access design uses the 172.16.0.0/12 network for the underlay addressing scheme and 192.168.0.0/16 for the overlay. Which answer lists addresses that could be useful on switches SW1, through SW4, respectively?",
        "explanation": "In a Cisco SD-Access fabric, the underlay IP addressing scheme uses a separate IP address space as compared to endpoint devices and the overlay network. The endpoint addresses (like PC1 and PC2 in this question) use addresses from the same address space as the overlay tunnels (address range 192.168.0.0/16 in this question.) The underlay uses addresses from the range 172.16.0.0/12. Also, switches SW2 and SW3, which do not sit at the edge of the network (and are therefore not Fabric Edge or Fabric Border nodes), do not participate in the overlay at all. So, of the four answers, only the correct answer shows all four addresses from the underlay range 172.16.0.0/12. Of the incorrect answers, some list addresses from the overlay address space that would be useful on edge/border nodes SW1 and SW4, but those answers also overlay addresses for switches SW2 and SW3, which do not need addresses in the overlay address space at all.",
        "difficulty": "4",
        "comments": "<p>4/12 - &quot;Did you read Chapter 17 of Volume 2 yet? If not, that holds all the answers. You will see an example with this same concept.&quot; .4/9 - query to Au</p>\n\n<p>&nbsp;</p>\n\n<p>4/3/24 Updated SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [
            {
                "ExhibitId": "0D8D93A8-C071-45ED-A60F-AD6AF04DAEF8",
                "ExhibitTitle": "1",
                "ExhibitFileName": "https://builder.pearsonitcertification.com/Content/Exhibits/0D8D93A8-C071-45ED-A60F-AD6AF04DAEF8/200301-ZZ-v2-1-17-14.jpg"
            }
        ],
        "answerChoices": [
            {
                "Text": "172.16.1.1, 172.16.2.1, 172.16.3.1, 172.16.4.1",
                "IsCorrect": true
            },
            {
                "Text": "172.16.1.1, 192.168.2.1, 192.168.3.1, 172.16.4.1",
                "IsCorrect": false
            },
            {
                "Text": "192.16.1.1, 192.168.2.1, 192.168.3.1, 192.168.4.1",
                "IsCorrect": false
            },
            {
                "Text": "192.168.1.1, 192.168.2.1, 192.168.3.1, 192.168.4.1",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "6B4A38D3-7C94-48E4-B685-A96FABC2FF15",
        "questionText": "When planning a greenfield Cisco SD-Access design, what traditional LAN design points should be included?",
        "explanation": "When planning a greenfield Cisco SD-Access design, the traditional LAN design points are\n\n\n\tThe number of switchports needed in each switch\n\tThe required speed of the switchports\n\tThe benefits of a switch stack in each location\n\tThe current cable lengths and types already used\n\tThe requirement to support power to endpoint devices\n\tThe current power available in each new switch\n\tLink capacity for links between switches\n\n\nAs for the incorrect options, a security firewall to properly segment traffic is actually something that does not help within the LAN portion of Cisco SD-Access. Also, in a greenfield deployment, typically the engineer would use Cisco Catalyst Center to automatically configure the underlay which would result in the use of IS-IS, not OSPF, and would not require any OSPF planning.\n&nbsp;",
        "difficulty": "3",
        "comments": "<p>4/3/24 Updated SDA to Cisco SD-Access and DNA Center to Cisco Catalyst Center -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "A security firewall to properly segment traffic",
                "IsCorrect": false
            },
            {
                "Text": "The benefits of a switch stack in each location",
                "IsCorrect": true
            },
            {
                "Text": "The current cable lengths and types already used",
                "IsCorrect": true
            },
            {
                "Text": "The OSPF area design for the underlay",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "7B373994-C812-4AA2-B138-AB34D1EC028D",
        "questionText": "Which of the following options are included with a typical underlay configuration for Cisco SD-Access?",
        "explanation": "Of the options listed, only IS-IS routing protocol is correct. Remember that with Cisco SD-Access, the underlay network is completely Layer 3 routed access. This means there is no Layer 2, which eliminates RSTP, FHRP, and any Layer 2 links as correct answers.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "IS-IS routing protocol",
                "IsCorrect": true
            },
            {
                "Text": "RSTP",
                "IsCorrect": false
            },
            {
                "Text": "FHRP",
                "IsCorrect": false
            },
            {
                "Text": "Layer 2 links",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "EBB18520-8EF6-42FB-A1A7-B069FAACEAFF",
        "questionText": "When using Cisco Catalyst Center, what is it called when you are leveraging the REST API or the GUI interface of Cisco Catalyst Center?",
        "explanation": "Most of your time as a user of the Cisco SD-Access network will be leveraging the Northbound APIs, which are the REST APIs and the front-end GUI of Cisco Catalyst Center. Telnet, SSH, SNMP, NETCONF, and RESTCONF are all examples of the Southbound APIs, which are ways Cisco Catalyst Center communicates to the network devices that it manages.",
        "difficulty": "1",
        "comments": "<p>4/3/24 Updated DNA Center to Catalyst Center and SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Southbound APIs",
                "IsCorrect": false
            },
            {
                "Text": "Northbound APIs",
                "IsCorrect": true
            },
            {
                "Text": "Telnet, SSH, and SNMP",
                "IsCorrect": false
            },
            {
                "Text": "NETCONF, RESTCONF",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "E46DBA1F-E5D2-4EAE-B74B-CE816344B1C2",
        "questionText": "Where in the&nbsp;Cisco SD-Access fabric is the VXLAN tunneling performed?",
        "explanation": "The VXLAN tunneling process for encapsulation and de-encapsulation is performed by the ASIC on each switch within the Cisco SD-Access fabric. This is why it is imperative to make sure to utilize the devices on the Cisco SD-Access compatibility list.",
        "difficulty": "1",
        "comments": "<p>12/29 - adj typo &quot;de-encapsulation&quot;</p>\n\n<p>4/3/24 Updated SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Control node",
                "IsCorrect": false
            },
            {
                "Text": "Border node",
                "IsCorrect": false
            },
            {
                "Text": "ASIC on each switch",
                "IsCorrect": true
            },
            {
                "Text": "DNA Center",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "706D18B8-0F2D-44EB-AF45-DA3D8C07573C",
        "questionText": "When planning a greenfield Cisco SD-Access design, what traditional LAN design points should be included?",
        "explanation": "&nbsp;\n\nWhen planning a greenfield Cisco SD-Access design, the traditional LAN design points are\n\n\n\tThe number of switchports needed in each switch\n\tThe required speed of the switchports\n\tThe benefits of a switch stack in each location\n\tThe current cable lengths and types already used\n\tThe requirement to support power to endpoint devices\n\tThe current power available in each new switch\n\tLink capacity for links between switches\n\n\nAs for the incorrect options, a security firewall to properly segment traffic is actually something that does not help within the LAN portion of Cisco SD-Access.&nbsp;",
        "difficulty": "2",
        "comments": "<p>4/3/24 Updated SDA to Cisco SD-Access -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "A security firewall to properly segment traffic",
                "IsCorrect": false
            },
            {
                "Text": "Link capacity for links between switches",
                "IsCorrect": true
            },
            {
                "Text": "The requirement to support power to endpoint devices",
                "IsCorrect": true
            },
            {
                "Text": "The current power available in each new switch",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "CFB59E5D-6EF3-4DDF-9A90-0CF8A4467189",
        "questionText": "Which part of the following URI is the path?\n\n\nhttps://CatalystCenter.example.com/dna/intent/api/v1/interface/network-device?/1/1/5\n\n&nbsp;",
        "explanation": "The path is /dna/intent/api/v1/interface/network-device. This is also called the resource.\n\nFor the incorrect answers, https is the protocol being used, and CatalystCenter.example.com is the hostname. /1/1/5 is the parameter being sent in the request.",
        "difficulty": "1",
        "comments": "<p>4/3/24 Updated DNAC to CatalystCenter -JG</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "/dna/intent/api/v1/interface/network-device",
                "IsCorrect": true
            },
            {
                "Text": "https",
                "IsCorrect": false
            },
            {
                "Text": "CatalystCenter.example.com",
                "IsCorrect": false
            },
            {
                "Text": "/1/1/5",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "E68F6047-C404-4246-A002-10D6270F58D7",
        "questionText": "What type of variable is being shown?\n\nRouters = [&quot;R1&quot;,&quot;R2&quot;,&quot;R3&quot;]",
        "explanation": "The text below the question shows a&nbsp; list variable. &nbsp;\n\n\tAs for the incorrect answers, an unsigned integer would be something like X = 7, which is also a simple variable because it is a single value. A dictionary variable uses key:value pairs like hostname: R1.",
        "difficulty": "1",
        "comments": "<p>\n\t3/28 - query to Au</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "List",
                "IsCorrect": true
            },
            {
                "Text": "Dictionary",
                "IsCorrect": false
            },
            {
                "Text": "Simple",
                "IsCorrect": false
            },
            {
                "Text": "Unsigned integers",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "9D03AB9A-9184-4C2C-AA4B-1474488085BE",
        "questionText": "Consider two consecutive REST API calls from a client to a server. Which answer best describes the fact that REST is stateless?",
        "explanation": "REST stateless operation means that the server will not store any data about one API call for use in processing subsequent API calls. As a result, the REST client must send all data relevant to each API call with each call. Each call can include data, encoded as part of the URI path (resource) and parameters (query field).\n\n\tTwo of the incorrect answers refer to the REST server making use of information gathered in the first API call to process the second, which goes against stateless operation. The other incorrect answer claims that no data can be sent in a REST API call, whereas RESTAPI calls can include data in the parameter (query) field of a URI.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Both REST API calls from the client must include all necessary data along with that one API call.",
                "IsCorrect": true
            },
            {
                "Text": "The second API call can rely on data stored on the server based on the first API call.",
                "IsCorrect": false
            },
            {
                "Text": "The second REST API call can refer to data created by the first API call by including the URI used in the first API call.",
                "IsCorrect": false
            },
            {
                "Text": "Neither REST API call can pass data from the client to the server.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "A7608BE9-C642-45C4-A07C-1F296CB6B88A",
        "questionText": "What does CRUD stand for?",
        "explanation": "CRUD is an acronym for the four primary actions an application performs. They are Create, Read, Update, and Delete.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Create, Read, Uniform, Delete",
                "IsCorrect": false
            },
            {
                "Text": "Copy, Read, Update, Delegate",
                "IsCorrect": false
            },
            {
                "Text": "Create, Read, Update, Delete",
                "IsCorrect": true
            },
            {
                "Text": "Copy, Read, Uniform, Delegate",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "8B3A5931-10E6-445B-8D44-29499F9AD499",
        "questionText": "From the following options, what are the required REST API attributes?",
        "explanation": "&nbsp;\n\n\tThere are six required attributes for REST APIs, including these two attributes:\n\n\t\n\t\tClient/server architecture: REST APIs operate in the client/server model. This means that an application is built with RESTful APIs that act as the server. A client computer or device would make a RESTful API call to the application.\n\t\n\t\tLayered system: With REST APIs, you can leverage the single URI to complete any task at hand. In the background you have no idea that the URI you used actually ended up utilizing several servers/services in the back end.\n\n\n\tAdditionally, note that while JSON data can be transferred over a REST API, REST does not require the use of JSON.&nbsp;",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "JSON-formatted data",
                "IsCorrect": false
            },
            {
                "Text": "Unlayered systems",
                "IsCorrect": false
            },
            {
                "Text": "Layered systems",
                "IsCorrect": true
            },
            {
                "Text": "Client-server architecture",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "6EF4D553-7B62-4262-9125-5BEB95E49D1A",
        "questionText": "Using the exhibit as a reference, what option(s) is a key:value pair?",
        "explanation": "The key:value pair is &ldquo;lastUpdateTime&quot;: 1572317520439, which includes both the key and the value. As for the incorrect options, &ldquo;role&rdquo; is a key and &ldquo;CSR1000V&rdquo; is a value but neither are full key:value pairs. Finally, &ldquo;platformId&rdquo;: lists both the key and the colon but it omits the value.\n\nNote:&nbsp;This output is directly from a Cisco Catalyst Center RESTful API request called &ldquo;Get Network Device by IP&rdquo; and the output is in JSON form.",
        "difficulty": "3",
        "comments": "<p>4/3/24 Updated DNA Center to Cisco Catalyst Center -JG</p>\n",
        "exhibits": [
            {
                "ExhibitId": "FA4F5DE2-E611-4BD7-9B51-1ACA05296E06",
                "ExhibitTitle": "4",
                "ExhibitFileName": "https://builder.pearsonitcertification.com/Content/Exhibits/FA4F5DE2-E611-4BD7-9B51-1ACA05296E06/200301-ZZ-v2-2-18-19.html"
            }
        ],
        "answerChoices": [
            {
                "Text": "&quot;lastUpdateTime&quot;: 1572317520439",
                "IsCorrect": true
            },
            {
                "Text": "&quot;CSR1000V&quot;",
                "IsCorrect": false
            },
            {
                "Text": "&quot;role&quot;",
                "IsCorrect": false
            },
            {
                "Text": "&quot;platformId&quot;:",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "D9D0EF97-C2D8-41E9-ACDE-62BC36DC1606",
        "questionText": "Which options are examples of simple variables?",
        "explanation": "Python simple variables include the following:\n\n\t\n\t\tUnsigned integers\n\t\n\t\tSigned integers\n\t\n\t\tFloating-point numbers\n\t\n\t\tText\n\n\n\tSigned integers and X = 15 are the correct answers; X = 15 is an unsigned integer. As for the incorrect options, list and dictionary are different types of variables that can handle more complex data structures.\n\t&nbsp;",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Signed integers",
                "IsCorrect": true
            },
            {
                "Text": "List",
                "IsCorrect": false
            },
            {
                "Text": "Dictionary",
                "IsCorrect": false
            },
            {
                "Text": "X = 15",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "4D13E8EC-F08F-4BE0-B583-7223E4EBEC60",
        "questionText": "Which term is commonly used to refer to the &ldquo;scheme&rdquo; in a URI, according to REST API documentation and tools?",
        "explanation": "The term scheme refers to the protocol or scheme used to access the resource. For example, in the URI https://example.com, &ldquo;https&rdquo; is the scheme or protocol that is used for communication. A Parameter or Query field in the URI is used to pass parameters or data to the server. Host:Port refers to the hostname of the application or controller and the port number used to connect. This is also known as the authority field in a URI structure. Finally, the Path field in the URI structure is commonly referred to as the Resource. It identifies the specific resource being accessed on the server.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Resource",
                "IsCorrect": false
            },
            {
                "Text": "Parameter",
                "IsCorrect": false
            },
            {
                "Text": "Host:Port",
                "IsCorrect": false
            },
            {
                "Text": "Protocol",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "BFF31091-7EB6-40BD-9185-B22E036EC472",
        "questionText": "Looking at the exhibit, what key:value pair option has a value that is numeric in nature?",
        "explanation": "The key:value pair that has a numeric value is &ldquo;lastUpdateTime&quot;: 1572317520439. To realize this fact, you can look for values not enclosed in quotes, as JSON requires quotes around string values, but requires the absence of quotes around numeric values.\n\n\tAs for the incorrect options, altough they all have numbers for their values, the incorrect answers are shown in the JSON text enclosed in quotes, so the values are strings.&nbsp;\n\n\tNote: This output is directly from a DNA Center RESTful API request called &ldquo;Get Network Device by IP&rdquo; and the output is in JSON form.",
        "difficulty": "3",
        "comments": "",
        "exhibits": [
            {
                "ExhibitId": "64F3F2EA-5217-48BA-A22E-35D3434D206A",
                "ExhibitTitle": "4",
                "ExhibitFileName": "https://builder.pearsonitcertification.com/Content/Exhibits/64F3F2EA-5217-48BA-A22E-35D3434D206A/200301-ZZ-v2-2-18-19.html"
            }
        ],
        "cat": "AUTO",
        "answerChoices": [
            {
                "Text": "&quot;upTime&quot;: &quot;45 days, 13:36:14.80&quot;,",
                "IsCorrect": false
            },
            {
                "Text": "&quot;lastUpdated&quot;: &quot;2019-10-29 02:52:00&quot;,",
                "IsCorrect": false
            },
            {
                "Text": "&quot;managementIpAddress&quot;: &quot;10.230.1.1&quot;,",
                "IsCorrect": false
            },
            {
                "Text": "&ldquo;lastUpdateTime&quot;: 1572317520439",
                "IsCorrect": true
            }
        ]
    },
    {
        "questionId": "A1AA8E96-8F8F-4FEF-B8BD-BD0335F85D7C",
        "questionText": "Which part of the following URI is the resource?\n\n\nhttps://CatalystCenter.example.com/dna/intent/api/v1/topology/l3/?EIGRP",
        "explanation": "The resource is /dna/intent/api/v1/topology/l3. This is also called the path. https: is the protocol being used, and CatalystCenter.example.com is the hostname/address. EIGRP is the parameter being sent, located after the ? in the URI.",
        "difficulty": "1",
        "comments": "<p>8/8 - ok as-is, &quot;&nbsp;note that URI is the more correct term - check out the text just before Figure 1-11 in Chapter 1 of Volume 2 for a little more detail there.&quot;</p>\n\n<p>7/22 - query to Au</p>\n\n<p>4/3/24 Updated DNAC to CatalystCenter -JG</p>\n\n<p>&nbsp;</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "https",
                "IsCorrect": false
            },
            {
                "Text": "CatalystCenter.example.com",
                "IsCorrect": false
            },
            {
                "Text": "/dna/intent/api/v1/topology/l3",
                "IsCorrect": true
            },
            {
                "Text": "EIGRP",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "890347BF-C07F-4048-9FCD-DD742AF293C4",
        "questionText": "Using the exhibit as a reference, what is a valid key?",
        "explanation": "A key is the text in double quotes before the colon of a key:value pair. In this case it is &ldquo;role&rdquo;.\n\n\t&ldquo;lastUpdateTime&rdquo;: 1572317520439 is a full key:value pair and &ldquo;CSR1000V&rdquo; is the value portion of a key:value pair. &ldquo;platformId&rdquo;: is an incorrect option because the colon is included.\n\n\tNote:&nbsp;This output is directly from a DNA Center RESTful API request called &ldquo;Get Network Device by IP&rdquo; and the output is in JSON form.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [
            {
                "ExhibitId": "A8B6D849-2B4E-4B07-94B0-CAA2EE94E891",
                "ExhibitTitle": "4",
                "ExhibitFileName": "https://builder.pearsonitcertification.com/Content/Exhibits/A8B6D849-2B4E-4B07-94B0-CAA2EE94E891/200301-ZZ-v2-2-18-19.html"
            }
        ],
        "cat": "AUTO",
        "answerChoices": [
            {
                "Text": "&quot;lastUpdateTime&quot;: 1572317520439",
                "IsCorrect": false
            },
            {
                "Text": "&quot;CSR1000V&quot;",
                "IsCorrect": false
            },
            {
                "Text": "&quot;role&quot;",
                "IsCorrect": true
            },
            {
                "Text": "&quot;platformId&quot;:",
                "IsCorrect": false
            }
        ]
    },
    {
        "questionId": "BEDB1965-8D50-415B-AACE-E304320F3895",
        "questionText": "From the following options, what are the required REST API attributes?",
        "explanation": "There are six required attributes for REST APIs:\n\n\t\n\t\tClient/server architecture: REST APIs operate in the client/server model. This means that an application is built with RESTful APIs that act as the server. A client computer or device would make a RESTful API call to the application.\n\t\n\t\tStateless operation: All of the state for the connections between client and server is actually on the client. The servers do not hold any state for that connection. This is good because it puts less load on the servers so they can process more requests. From a client perspective, the client must be sure to send the necessary information that the server will need to complete the request.\n\t\n\t\tClear determination of whether a resource can be cached: With REST APIs, servers can cache the most used resources. This is usually used with GET requests. Caching can speed up the operations and the responses to the users.\n\t\n\t\tUniform interface: In the RESTful world, everything is perceived to be a resource, no matter whether it&rsquo;s a document, function, method, class, or module. This simple uniformity of interface leads to consistency and rapid deployment of new systems.\n\t\n\t\tLayered system: With REST APIs, you can leverage the single URI to complete any task at hand. In the background you have no idea that the URI you used actually ended up utilizing several servers/services in the back end.\n\t\n\t\tCode on demand: With REST APIs, you can determine what form of data you want back, and not just the values of data. If you want the form of data to be JSON, XML, or YAML, you can specify that. This is still all with a single URI because it&rsquo;s just a value in the header of the request.\n\n\n\tFor the incorrect options, REST APIs do not run in a peer-to-peer architecture and do not leverage a dynamic interface.",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Clear determination of whether a resource can be cached",
                "IsCorrect": true
            },
            {
                "Text": "Dynamic interface",
                "IsCorrect": false
            },
            {
                "Text": "Uniform interface",
                "IsCorrect": true
            },
            {
                "Text": "Peer-to-peer architecture",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "AF53E560-325F-45C7-826A-FAE3C6D39972",
        "questionText": "What are the benefits of REST API resources being cacheable?",
        "explanation": "REST APIs leverage caching on the server side to increase overall performance by reducing the number of times the server has to retrieve the same resources. This is similar to how web traffic is done today.\n\n\tAs for the incorrect answers, the response time for a GET request can be decreased (improved) rather than increased (made worse) by virtue of the objective being cacheable. For PUT requests, in which the client sets a value on the server, caching is not used. Finally, cacheability has nothing to do with REST stateless operation.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It enables stateless REST GET response and reply operations",
                "IsCorrect": false
            },
            {
                "Text": "It increases client response times by caching GET requests locally",
                "IsCorrect": false
            },
            {
                "Text": "It improves overall performance because the server retrieves resources less often",
                "IsCorrect": true
            },
            {
                "Text": "It decreases client latency times by caching PUT requests locally",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "24DB75F5-7CAA-499A-9152-28B70BD3C1C2",
        "questionText": "In the context of network configuration management, what term is used to describe the situation when device configurations deviate from the intended ideal configuration over time?",
        "explanation": "Configuration drift is the difference in configuration that deviates from the wanted or ideal state of configuration. Configuration mirroring is a method of duplicating or replicating existing configurations. Configuration monitoring is the act of looking at the configuration over time to see whether there are any changes or deviations (drift). Configuration enforcement is the method of making sure the configuration either doesn&rsquo;t change or is enforced to change back to what the ideal state is supposed to be.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Configuration mirroring",
                "IsCorrect": false
            },
            {
                "Text": "Configuration drift",
                "IsCorrect": true
            },
            {
                "Text": "Configuration enforcement",
                "IsCorrect": false
            },
            {
                "Text": "Configuration monitoring",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "D3230E7B-42E4-4EBA-817F-3016A3BD62E6",
        "questionText": "Which of the following are attributes of Terraform?",
        "explanation": "Ansible uses playbooks, is agentless, and leverages YAML modeling language. Terraform uses a declarative model for communications.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Playbook",
                "IsCorrect": false
            },
            {
                "Text": "Agentless",
                "IsCorrect": false
            },
            {
                "Text": "Client/server model",
                "IsCorrect": true
            },
            {
                "Text": "YAML",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "4101C724-5D74-4F98-B73B-568B6D164669",
        "questionText": "During a maintenance window, you make some changes to R2. You document these changes in your configuration management system. Later that night, you are called in to fix an issue that requires you to make additional changes to R2. The next morning your co-worker addresses another issue but this time on R1. All of these changes are documented properly but neither you or your coworker discuss the changes. These changes stay implemented for months. What is this best described as?",
        "explanation": "What is happening within the environment is known as configuration drift. Configuration drift is when changes are made to a device or multiple devices that are not the intended configurations.\n\n\tThis is not version control. Version control is tracking the different changes that have occurred in a repository or system and creating version numbers for each change. This enables you as an operator to restore a past configuration version if the need arises.\n\n\tCentralized configuration is a process of moving the configurations to a central server or service. The key with this process is to make sure future changes to configurations are actually completed on the central server and not on the individual devices themselves.\n\n\tConfiguration monitoring is an alert that the configuration of a device is different than the intended configuration. This allows an operator to resolve the configuration issue as soon as possible.",
        "difficulty": "2",
        "comments": "<p>\n\t1/20 - fixed typo in question</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Version control",
                "IsCorrect": false
            },
            {
                "Text": "Centralized configuration",
                "IsCorrect": false
            },
            {
                "Text": "Configuration drift",
                "IsCorrect": true
            },
            {
                "Text": "Configuration monitoring",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "7AE43FE8-AA01-4AFE-80FB-58DCAA378DA9",
        "questionText": "What are some valid benefits of configuration provisioning when utilizing a configuration management system?",
        "explanation": "There are so many benefits to configuration provisioning that it would be inconceivable to write them all here. In general, each benefit is about increasing efficiency, flexibility, and alerting for changes. Here are some examples of benefits:\n\n\t\n\t\tThe flexibility to select which devices to configure or edit, based on logic\n\t\n\t\tThe capability to be notified if a change or modification was properly implemented\n\t\n\t\tThe capability to revert changes if needed\n\t\n\t\tThe capability to leverage variables and advance logic with templates to configure multiple devices with similar roles\n\n\n\tConfiguring a single device is not a benefit of a CMS. While configuring one device could be seen as an increase in security it is not something a CMS provides specifically. Limiting the number of templates is not something that the CMS would do or we as operators would find beneficial. The CMS has templates that can be configured as you need them for your organization.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The capability to revert changes if needed",
                "IsCorrect": true
            },
            {
                "Text": "The capability to configure one device at a time, which increases security",
                "IsCorrect": false
            },
            {
                "Text": "The capability to leverage variables and advance logic with templates to configure multiple devices with similar roles",
                "IsCorrect": true
            },
            {
                "Text": "The capability to increase efficiency by limiting the CMS to one template per device role",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "A1D06F88-8D9F-47E2-AFD6-71ACF4FC78B6",
        "questionText": "Which stage of Terraform&rsquo;s core workflow involves creating an execution plan that describes the infrastructure changes based on the current configuration and infrastructure?",
        "explanation": "Write focuses on defining the configuration, plan involves generating an execution plan, and apply executes the proposed changes. Therefore, Plan is the correct answer because it specifically addresses the stage where the execution plan is created.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Write",
                "IsCorrect": false
            },
            {
                "Text": "Plan",
                "IsCorrect": true
            },
            {
                "Text": "Apply",
                "IsCorrect": false
            },
            {
                "Text": "Execute",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "EF412D49-A1C1-40EB-8901-777F6CA8A5FB",
        "questionText": "Which software-as-a-service platform is commonly used for version control and offers both free and paid accounts to help track changes for devices?",
        "explanation": "GitHub offers free and paid accounts with varying levels of features. GitHub leverages the open-source software called Git to perform the version control functions. &ldquo;Get&rdquo; is related to HTTP, not version control. GetLab, GetHub, and GitLab are incorrect.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "GitLab",
                "IsCorrect": false
            },
            {
                "Text": "GetLab",
                "IsCorrect": false
            },
            {
                "Text": "GitHub",
                "IsCorrect": true
            },
            {
                "Text": "GetHub",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "DB3B69EF-223C-4BDB-A64E-7D5FD76A3358",
        "questionText": "What are some valid benefits of configuration provisioning when utilizing a configuration management system?",
        "explanation": "There are so many benefits to configuration provisioning that it would be inconceivable to write them all here. In general, each benefit is about increasing efficiency, flexibility, and alerting for changes. Here are some examples of benefits:\n\n\t\n\t\tThe flexibility to select which devices to configure or edit, based on logic\n\t\n\t\tThe capability to be notified if a change or modification was properly implemented\n\t\n\t\tThe capability to revert changes if needed\n\t\n\t\tThe capability to leverage variables and advance logic with templates to configure multiple devices with similar roles.\n\n\n\tAs for the incorrect options, configuring a single device is not a benefit of a CMS. While configuring one device could be seen as an increase in security it is not something a CMS provides specifically. Limiting the number of templates is not something that the CMS would do or operators would find beneficial. The CMS has templates that can be configured as you need them for your organization.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The flexibility to select which devices to configure or edit, based on logic",
                "IsCorrect": true
            },
            {
                "Text": "The capability to be notified if a change or modification was properly implemented",
                "IsCorrect": true
            },
            {
                "Text": "The capability of a single device to be configured at a time, which increases security",
                "IsCorrect": false
            },
            {
                "Text": "Increased efficiency by limiting the CMS to one template per device role",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "A0C8609E-C641-4656-8383-BD51554666DC",
        "questionText": "When thinking about the configuration of network devices, if you want to know what changed, when it changed, and/or who changed it, what should you implement?",
        "explanation": "Version control tracks the different changes that have occurred in a repository or system that creates version numbers for each change. This enables you as an operator to restore a past configuration version if the need arises.\n\n\tThe incorrect answers may implement some of the three features mentioned in the question, but not all. For instance, centralized configuration refers to a process of moving the configurations to a central server or service. However, centralizing the configuration for all devices alone does not then track changes, monitor for drift between the individual device configuration and the centralized configuration for a device.\n\n\tThe term configuration drift refers to the effect of changes made to one or more devices&#39; configurations that are not the intended configurations, in effect drifting away from the ideal centralized version of the configuration. In short, this answer refers to an effect that you want to prevent using configuration management and version control.\n\n\tConfiguration monitoring refers to a feature of configuration management that creates an alert when the configuration of a device is different than the intended configuration. This enables an operator to resolve the configuration issue as soon as possible. To perform its role, configuration monitoring requires version control.&nbsp;",
        "difficulty": "2",
        "comments": "<p>\n\t5/20 - Typo fix</p>\n",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Version control",
                "IsCorrect": true
            },
            {
                "Text": "Centralized configuration",
                "IsCorrect": false
            },
            {
                "Text": "Configuration drift",
                "IsCorrect": false
            },
            {
                "Text": "Configuration monitoring",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "FD5A0722-1C47-442F-B2BB-C252881EB0AF",
        "questionText": "What is a good example of what is meant by configuration drift?",
        "explanation": "&nbsp;\n\n\tConfiguration drift occurs when one or more devices&#39; configuration change as compared to their intended configurations.\n\n\tAs for the incorrect answers, not all devices are consistent and not all devices are inconsistent.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Consistent configuration for all devices in the same role",
                "IsCorrect": false
            },
            {
                "Text": "Changes to a single device that deviate from the intended configuration",
                "IsCorrect": true
            },
            {
                "Text": "Inconsistent configuration for all devices in the same role",
                "IsCorrect": true
            },
            {
                "Text": "Changes to multiple devices that deviate from the intended configuration",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "4C98A824-059E-492B-B627-C9C431868C93",
        "questionText": "If you want to be alerted when a device configuration differs from the intended configuration, what should you implement?",
        "explanation": "Configuration monitoring should be implemented here. It is an alert that the configuration of a device is different than the intended configuration. This enables an operator to resolve the configuration issue as soon as possible.\n\n\tThis is not centralized configuration. Centralized configuration is a process of moving the configurations to a central server or service. The key with this process is to make sure future changes to configurations are actually completed on the central server and not on the individual devices themselves.\n\n\tVersion control is tracking the different changes that have occurred in a repository or system and creating version numbers for each change. This enables you as an operator to restore a past configuration version if the need arises.\n\n\tConfiguration drift is when changes are made to a device or multiple devices that are not the intended configurations.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Version control",
                "IsCorrect": false
            },
            {
                "Text": "Centralized configuration",
                "IsCorrect": false
            },
            {
                "Text": "Configuration drift",
                "IsCorrect": false
            },
            {
                "Text": "Configuration monitoring",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "332C69B2-BAB2-49D6-99EB-DAC2A7665AE7",
        "questionText": "How does Ansible make changes to devices?",
        "explanation": "Ansible leverages SSH and/or NETCONF to make changes to devices.\n\n\tAs for the incorrect options, one of the best benefits of Ansible is that it does not require an agent to be installed on any device. Ansible does not directly leverage REST APIs.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Agent installed on devices",
                "IsCorrect": false
            },
            {
                "Text": "SSH",
                "IsCorrect": true
            },
            {
                "Text": "NETCONF",
                "IsCorrect": true
            },
            {
                "Text": "REST APIs",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "4812EC70-B66C-4CFE-905E-E87A2FE3C380",
        "questionText": "Which of the following are stages of Terraform&rsquo;s core workflow?",
        "explanation": "There are only two correct answers here. Write, Plan, and Apply are the three stages used by Terraform&rsquo;s core workflow. Prepare and Execute are not part of Terraform&rsquo;s core workflow.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Write",
                "IsCorrect": true
            },
            {
                "Text": "Apply",
                "IsCorrect": true
            },
            {
                "Text": "Execute",
                "IsCorrect": false
            },
            {
                "Text": "Prepare",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "C233E6FA-75DB-4AEF-A449-FA4433CAD577",
        "questionText": "Which option shows what would happen if you were to implement a centralized configuration plan?",
        "explanation": "Centralized configuration management means that device configurations reside in a centralized repository. Once centralized, the process should result in all future changes occuring in the centralized configuration, after which the configuration is distributed into each device. For the incorrect options, changes are not completed locally on the device nor are they tracked locally on the device.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Device configurations would be changed locally but tracked from a server",
                "IsCorrect": false
            },
            {
                "Text": "Device configurations would be tracked locally but changed by a server",
                "IsCorrect": false
            },
            {
                "Text": "Device configurations would be changed and tracked by a server",
                "IsCorrect": true
            },
            {
                "Text": "Device configurations would be tracked and changed locally",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0092",
        "questionText": "Which is a negative outcome from automating a configuration change across the enterprise?",
        "explanation": "A negative outcome from automation of configuration across an enterprise is that you increase the odds of configuration conflicts. You decrease the odds of typographical errors when using automation because redundant commands do not need to be entered. The time spent building configurations should be no more or no less than normal once an automated system is established.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Increased odds of typographical errors",
                "IsCorrect": false
            },
            {
                "Text": "Increased odds of configuration conflicts",
                "IsCorrect": true
            },
            {
                "Text": "Increased time spent building configurations",
                "IsCorrect": false
            },
            {
                "Text": "Decreased time spent building configurations",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0094",
        "questionText": "Which protocol is used with the southbound interface in the SDN controller?",
        "explanation": "The OpenFlow protocol is an open standard used to configure network devices via the southbound interface (SBI) of the software-defined networking (SDN) controller. Python is a common programming language that is used for the programming of an SDN controller via the northbound interface (NBI) of the SDN controller. Representational State Transfer (REST) is an architecture for moving data using the Hypertext Transfer Protocol (HTTP). JavaScript Object Notation (JSON) is a data-interchange format used with many different SDN controllers.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Python",
                "IsCorrect": false
            },
            {
                "Text": "OpenFlow",
                "IsCorrect": true
            },
            {
                "Text": "REST",
                "IsCorrect": false
            },
            {
                "Text": "JSON",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0095",
        "questionText": "On which layer does the fabric of a software-defined network switch packets?",
        "explanation": "The fabric of a software-defined network switches packets on layer 3. All of the other options are incorrect.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Layer 2",
                "IsCorrect": false
            },
            {
                "Text": "Layer 3",
                "IsCorrect": true
            },
            {
                "Text": "Layer 6",
                "IsCorrect": false
            },
            {
                "Text": "Layer 7",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0096",
        "questionText": "Where inside of the Cisco DNA Center can you configure the upgrade of IOS for network devices?",
        "explanation": "You can configure the upgrade of IOS for network devices from the Provision section of the Cisco DNA Center. The Design section allows you to create a hierarchical design of the network, with a graphical map. The Policy section allows you to create policies based on applications, traffic, and IP-based access control lists (ACLs), just to name a few. The Assurance section of the Cisco DNA Center allows you to see the overall health of network devices managed by DNA Center.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Provision",
                "IsCorrect": true
            },
            {
                "Text": "Design",
                "IsCorrect": false
            },
            {
                "Text": "Policy",
                "IsCorrect": false
            },
            {
                "Text": "Assurance",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0097",
        "questionText": "You are testing a POST function on a REST-based API and a 401 status code was returned. What does that mean?",
        "explanation": "When a status code of 401 is returned, it means that the method was unauthorized. A status code of 200 or 202 means the method was okay or accepted; these are the two most common.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The POST was accepted.",
                "IsCorrect": false
            },
            {
                "Text": "The POST was redirected to another URI.",
                "IsCorrect": false
            },
            {
                "Text": "The POST was unauthorized.",
                "IsCorrect": true
            },
            {
                "Text": "The POST was not in the right format.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0098",
        "questionText": "Which configuration management mechanism uses Python and YAML as a configuration language?",
        "explanation": "Ansible uses a configuration file and can be programmed with Python. Desired State Configuration (DSC) is a Microsoft-centric product that is programmed in PowerShell. Chef uses Domain Specific Language (DSL) with Ruby. Puppet uses DSL with the PuppetDSL language.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "DSC",
                "IsCorrect": false
            },
            {
                "Text": "Chef",
                "IsCorrect": false
            },
            {
                "Text": "Puppet",
                "IsCorrect": false
            },
            {
                "Text": "Ansible",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0099",
        "questionText": "Which is a requirement for using Ansible for configuration management?",
        "explanation": "A requirement for using Ansible for configuration management is root Secure Shell (SSH) access to the remote system. Internet access is only required if you are managing a system across the Internet. An unrestricted firewall is not required because you only need port 22 TCP (SSH) for Ansible to access the remote machine. Ansible is scripted with Python and not Ruby.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Internet access",
                "IsCorrect": false
            },
            {
                "Text": "Root SSH",
                "IsCorrect": true
            },
            {
                "Text": "Unrestricted firewall",
                "IsCorrect": false
            },
            {
                "Text": "Ruby",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c07-ex-0100",
        "questionText": "Which command is used to output JSON from the execution of a command on a Cisco router or switch?",
        "explanation": "The command show interface status | json-pretty native is used to convert the output of a command to JSON in a Cisco router or switch. You will enter the command first, such as show interface status, and then pipe the output to the | json-pretty command and specify native formatting. The commands json interface status, show interface status | json, and show interface status json are incorrect.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "show interface status | json-pretty native",
                "IsCorrect": true
            },
            {
                "Text": "json interface status",
                "IsCorrect": false
            },
            {
                "Text": "show interface status | json",
                "IsCorrect": false
            },
            {
                "Text": "show interface status json",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0092",
        "questionText": "Which is a negative outcome from automating a configuration change across the enterprise?",
        "explanation": "A negative outcome from automation of configuration across an enterprise is that you increase the odds of configuration conflicts. You decrease the odds of typographical errors when using automation because redundant commands do not need to be entered. The time spent building configurations should be no more or no less than normal once an automated system is established.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Increased odds of typographical errors",
                "IsCorrect": false
            },
            {
                "Text": "Increased odds of configuration conflicts",
                "IsCorrect": true
            },
            {
                "Text": "Increased time spent building configurations",
                "IsCorrect": false
            },
            {
                "Text": "Decreased time spent building configurations",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0094",
        "questionText": "Which protocol is used with the southbound interface in the SDN controller?",
        "explanation": "The Virtual Extensible LAN (VXLAN) protocol is commonly found on the overlay of a software-defined network (SDN). It allows for the transport of layer 2 frames over a layer 3 network. The Open Shortest Path First (OSPF) protocol is a layer 3 networking protocol commonly found on the underlay of SDN. OpenFlow is a protocol that is used for the programming of network devices from the Southbound interface (SBI) of the SDN controller. JavaScript Object Notation (JSON) is a data-interchange format used with many different SDN controllers.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "VXLAN",
                "IsCorrect": true
            },
            {
                "Text": "OSPF",
                "IsCorrect": false
            },
            {
                "Text": "OpenFlow",
                "IsCorrect": false
            },
            {
                "Text": "JSON",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0095",
        "questionText": "Which is commonly used with the northbound interface of an SDN controller?",
        "explanation": "The Python programming language is commonly used with the northbound interface (NBI) of a software-defined network (SDN) controller. The term CLOS describes Spine/Leaf network switching. The Open-Flow and NETCONF protocols are commonly used with the southbound interface (SBI) of an SDN controller for programming the SDN devices.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "CLOS",
                "IsCorrect": false
            },
            {
                "Text": "OpenFlow",
                "IsCorrect": false
            },
            {
                "Text": "Python",
                "IsCorrect": true
            },
            {
                "Text": "NETCONF",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0097",
        "questionText": "You are testing a POST function on a REST-based API and a 401 status code was returned. What does that mean?",
        "explanation": "When a status code of 401 is returned, it means that the method was unauthorized. A status code of 200 or 202 means the method was okay or accepted; these are the two most common.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The POST was accepted.",
                "IsCorrect": false
            },
            {
                "Text": "The POST was redirected to another URI.",
                "IsCorrect": false
            },
            {
                "Text": "The POST was unauthorized.",
                "IsCorrect": true
            },
            {
                "Text": "The POST was not in the right format.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0098",
        "questionText": "Which configuration management mechanism uses Python and YAML as a configuration language?",
        "explanation": "Ansible uses a configuration file and can be programmed with Python. Desired State Configuration (DSC) is a Microsoft-centric product that is programmed in PowerShell. Chef uses Domain Specific Language (DSL) with Ruby. Puppet uses DSL with the PuppetDSL language.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "DSC",
                "IsCorrect": false
            },
            {
                "Text": "Chef",
                "IsCorrect": false
            },
            {
                "Text": "Puppet",
                "IsCorrect": false
            },
            {
                "Text": "Ansible",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0099",
        "questionText": "Which is a requirement for using Ansible for configuration management?",
        "explanation": "A requirement for using Ansible for configuration management is root Secure Shell (SSH) access to the remote system. Internet access is only required if you are managing a system across the Internet. An unrestricted firewall is not required because you only need port 22 TCP (SSH) for Ansible to access the remote machine. Ansible is scripted with Python and not Ruby.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Internet access",
                "IsCorrect": false
            },
            {
                "Text": "Root SSH",
                "IsCorrect": true
            },
            {
                "Text": "Unrestricted firewall",
                "IsCorrect": false
            },
            {
                "Text": "Ruby",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "c08-ex-0100",
        "questionText": "Which command is used to output JSON from the execution of a command on a Cisco router or switch?",
        "explanation": "The command show interface status | json-pretty native is used to convert the output of a command to JSON in a Cisco router or switch. You will enter the command first, such as show interface status, and then pipe the output to the | json-pretty command and specify native formatting. The commands json interface status, show interface status | json, and show interface status json are incorrect.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "show interface status | json-pretty native",
                "IsCorrect": true
            },
            {
                "Text": "json interface status",
                "IsCorrect": false
            },
            {
                "Text": "show interface status | json",
                "IsCorrect": false
            },
            {
                "Text": "show interface status json",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-b-25",
        "questionText": "Where is a device’s startup-config file stored?",
        "explanation": "The startup configuration file of a Cisco device is stored in Non-Volatile Random-Access Memory (NVRAM). Unlike standard RAM, NVRAM retains its contents even when the device is powered off.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Flash",
                "IsCorrect": false
            },
            {
                "Text": "RAM",
                "IsCorrect": false
            },
            {
                "Text": "NVRAM",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-p-72",
        "questionText": "Which type of Hypervisor is implemented when a user with a laptop running the Mac OS installs a Windows virtual OS instance?",
        "explanation": "Type 2, or hosted, hypervisors run as software on top of a host operating system (like macOS, Windows, or Linux). They are used to create and run guest virtual machines. Type 1, or bare-metal, hypervisors run directly on the system hardware without a host OS.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "virtual machine",
                "IsCorrect": false
            },
            {
                "Text": "bare metal",
                "IsCorrect": false
            },
            {
                "Text": "type 2",
                "IsCorrect": true
            },
            {
                "Text": "type 1",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-p-73",
        "questionText": "Which two layers of the OSI model are associated with SDN network control plane functions that make forwarding decisions? (Choose two.)",
        "explanation": "The control plane is responsible for making forwarding decisions. In traditional networking, this involves Layer 2 functions like building MAC address and ARP tables, and Layer 3 functions like building the IP routing table. In SDN, these functions are centralized in the SDN controller.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Layer 1",
                "IsCorrect": false
            },
            {
                "Text": "Layer 2",
                "IsCorrect": true
            },
            {
                "Text": "Layer 3",
                "IsCorrect": true
            },
            {
                "Text": "Layer 4",
                "IsCorrect": false
            },
            {
                "Text": "Layer 5",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-p-74",
        "questionText": "What defines a two-tier spine-leaf topology?",
        "explanation": "In a spine-leaf architecture, a common data center design, every leaf switch connects to every spine switch in a full-mesh topology. Devices like servers and APICs (in a Cisco ACI fabric) connect to the leaf switches. There are no connections between leaf switches or between spine switches.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The APIC controller manipulates the data path directly.",
                "IsCorrect": false
            },
            {
                "Text": "The Cisco APICs and all other devices in the network physically attach to leaf switches.",
                "IsCorrect": true
            },
            {
                "Text": "The spine tier can be implemented with Cisco Nexus 9500 switches connected to each other and to the leaf switches.",
                "IsCorrect": false
            },
            {
                "Text": "Everything is two hops from everything else.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-p-81",
        "questionText": "When JSON data format is being used, what characters are used to hold objects?",
        "explanation": "A JavaScript Object Notation (JSON) object is a collection of key-value pairs. The entire object is enclosed in curly braces { }.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "double quotations \" \"",
                "IsCorrect": false
            },
            {
                "Text": "double brackets [ ]",
                "IsCorrect": false
            },
            {
                "Text": "double braces { }",
                "IsCorrect": true
            },
            {
                "Text": "double colons : :",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-p-88",
        "questionText": "Refer to the exhibit. Which data format is used to represent the data for network automation applications?",
        "explanation": "The exhibit shows data structured with key: value pairs and indentation to define structure, without brackets or commas. This is characteristic of YAML (YAML Ain't Markup Language).",
        "difficulty": "2",
        "comments": "",
        "exhibits": [
            {
                "ExhibitDescription": "A text snippet showing key-value pairs with indentation.",
                "ExhibitId": "F6B388D4-F578-4394-AF5D-851571249A2E",
                "ExhibitTitle": "Data Format Example",
                "ExhibitFileName": "https://itexamanswers.net/wp-content/uploads/2020/08/i349059v2n1_347059.png"
            }
        ],
        "answerChoices": [
            {
                "Text": "YAML",
                "IsCorrect": true
            },
            {
                "Text": "JSON",
                "IsCorrect": false
            },
            {
                "Text": "XML",
                "IsCorrect": false
            },
            {
                "Text": "HTML",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-p-109",
        "questionText": "What is a difference between the functions of Cloud computing and virtualization?",
        "explanation": "Virtualization is the technology that separates a computer resource, like the OS, from the underlying hardware. Cloud computing is a service model that uses virtualization to provide on-demand access to a shared pool of configurable computing resources (e.g., applications, servers, storage) over the internet.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Cloud computing provides services on web-based access whereas virtualization provides services on data access through virtualized Internet connections.",
                "IsCorrect": false
            },
            {
                "Text": "Cloud computing separates the application from the hardware whereas virtualization separates the OS from the underlying hardware.",
                "IsCorrect": true
            },
            {
                "Text": "Cloud computing requires hypervisor technology whereas virtualization is a fault tolerance technology.",
                "IsCorrect": false
            },
            {
                "Text": "Cloud computing utilizes data center technology whereas virtualization is not used in data centers.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-008",
        "questionText": "What are two benefits of using virtualization? (Choose two.)",
        "explanation": "Virtualization provides many benefits:\n* Aggregation of multiple guest operating systems on a single device\n* Less power usage\n* Faster OS recovery\n* OS independence of hardware platform",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The operating system of the virtual machine does not require licensing when it is virtualized.",
                "IsCorrect": false
            },
            {
                "Text": "The virtual machine is no longer dependent on a specific hardware platform.",
                "IsCorrect": true
            },
            {
                "Text": "Because all virtual operating systems are contained within a single virtual network, networking connections are simplified.",
                "IsCorrect": false
            },
            {
                "Text": "The performance of a virtual machine is faster than the performance of the operating system running on physical hardware.",
                "IsCorrect": false
            },
            {
                "Text": "Multiple virtual machines can be running simultaneously on a single physical device.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-013",
        "questionText": "What is a characteristic of the REST API?",
        "explanation": "REST accounts for more than 80% of all API types used for web services, making it the most widely used web service API.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "evolved into what became SOAP",
                "IsCorrect": false
            },
            {
                "Text": "most widely used API for web services",
                "IsCorrect": true
            },
            {
                "Text": "used for exchanging XML structured information over HTTP or SMTP",
                "IsCorrect": false
            },
            {
                "Text": "considered slow, complex, and rigid",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-014",
        "questionText": "A network administrator is using the Cisco DNA Center to monitor network health and to troubleshoot network issues. Which area should the administrator use to perform these tasks?",
        "explanation": "The Cisco DNA Center has five main areas:\n* Design – Model the entire network, from sites and buildings to devices and links, both physical and virtual, across campus, branch, WAN and cloud.\n* Policy – Use policies to automate and simplify network management, reducing cost and risk while speeding rollout of new and enhanced services.\n* Provision – Provide new services to users with ease, speed, and security across your enterprise network, regardless of network size and complexity.\n* Assurance – Use proactive monitoring and insights from the network, devices, and applications to predict problems faster and ensure that policy and configuration changes achieve the business intent and the user experience you want.\n* Platform – Use APIs to integrate with the preferred IT systems to create end-to-end solutions and add support for multi-vendor devices.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "ASSURANCE",
                "IsCorrect": true
            },
            {
                "Text": "PROVISION",
                "IsCorrect": false
            },
            {
                "Text": "PLATFORM",
                "IsCorrect": false
            },
            {
                "Text": "POLICY",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-015",
        "questionText": "Which term describes the process of managing configuration changes of network devices in an orderly fashion?",
        "explanation": "Configuration management tools typically include automation and orchestration. Automation is automatically performing a task on a system. Arranging the automated tasks into a coordinated process or workflow is called orchestration.",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "version control",
                "IsCorrect": false
            },
            {
                "Text": "orchestration",
                "IsCorrect": true
            },
            {
                "Text": "automation",
                "IsCorrect": false
            },
            {
                "Text": "provisioning",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-016",
        "questionText": "Which function of the Cisco intent-based networking system (IBNS) enables network operators to express the expected networking behavior that will best support the business intent?",
        "explanation": "The translation feature of Cisco IBNS enables network operators to express the expected network behavior that will best support the business intent.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "ACL analysis",
                "IsCorrect": false
            },
            {
                "Text": "assurance",
                "IsCorrect": false
            },
            {
                "Text": "activation",
                "IsCorrect": false
            },
            {
                "Text": "translation",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-017",
        "questionText": "Which type of API would be used to allow authorized salespeople of an organization access to internal sales data from their mobile devices?",
        "explanation": "Private, or internal, APIs are used only within an organization and are for company access to data and services for internal use.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "private",
                "IsCorrect": true
            },
            {
                "Text": "partner",
                "IsCorrect": false
            },
            {
                "Text": "public",
                "IsCorrect": false
            },
            {
                "Text": "open",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-018",
        "questionText": "Refer to the exhibit. In the displayed JSON data representation, which symbol should be used to replace the question mark in lines 2 and 15?",
        "explanation": "In the JSON syntax, square brackets [ ] are used to enclose an array.",
        "difficulty": "2",
        "exhibits": [
            {
                "ExhibitId": "itn-pr-ex-ccna-018-img",
                "ExhibitTitle": "JSON data structure",
                "ExhibitFileName": "https://itexamanswers.net/wp-content/uploads/2020/09/i349062v1n4_347062.png"
            }
        ],
        "answerChoices": [
            {
                "Text": "square brackets [ ]",
                "IsCorrect": true
            },
            {
                "Text": "commas ,",
                "IsCorrect": false
            },
            {
                "Text": "double quotation marks ” “",
                "IsCorrect": false
            },
            {
                "Text": "braces { }",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-063",
        "questionText": "Refer to the exhibit. What does the hyphen symbol (-) indicate in the YAML data structure?\nRefer to the exhibit. What does the hyphen symbol (–) indicate in the YAML data structure?",
        "explanation": "In YAML syntax, key value pairs are separated by a colon without the use of quotation marks and a hyphen is used to separate each element in a list or an array.",
        "difficulty": "2",
        "exhibits": [
            {
                "ExhibitId": "itn-pr-ex-ccna-063-img",
                "ExhibitTitle": "YAML Data Structure",
                "ExhibitFileName": "https://itexamanswers.net/wp-content/uploads/2020/09/2020-09-04_220035.jpg"
            }
        ],
        "answerChoices": [
            {
                "Text": "a key/value pair that represents an IP address",
                "IsCorrect": false
            },
            {
                "Text": "a string being used for both the key and value",
                "IsCorrect": false
            },
            {
                "Text": "a single key/value pair",
                "IsCorrect": false
            },
            {
                "Text": "an element in an array",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-064",
        "questionText": "In an Intent-Based Networking architecture, which two items are considered parts of an overlay fabric? (Choose two.)",
        "explanation": "From the perspective of Intent-Base Networking (IBN), the physical and virtual network infrastructure is a fabric. Fabric is a term used to describe an overlay that represents the logical topology used to virtually connect to devices. The overlay limits the number of devices the network administrator must program. For example, the overlay is where encapsulation protocols like IP security (IPsec) and Control and Provisioning of Wireless Access Points (CAPWAP) occur.",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "switch",
                "IsCorrect": false
            },
            {
                "Text": "IPsec protocol",
                "IsCorrect": true
            },
            {
                "Text": "CAPWAP",
                "IsCorrect": true
            },
            {
                "Text": "server",
                "IsCorrect": false
            },
            {
                "Text": "router",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-065",
        "questionText": "What is an architectural constraint to which a true RESTful API web service must adhere?",
        "explanation": "Conforming to the constraints of the REST architecture is generally referred to as being “RESTful”. An API can be considered “RESTful” if it has the following features:\n* Client/server – The client handles the front end and the server handles the back end.\n* Stateless – No client data is stored on the server between requests. The session state is stored on the client.\n* Cacheable – Clients can cache responses locally to improve performance.",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It operates as a cloud service.",
                "IsCorrect": false
            },
            {
                "Text": "It runs as client/server model.",
                "IsCorrect": true
            },
            {
                "Text": "It must support the XML data format.",
                "IsCorrect": false
            },
            {
                "Text": "It uses HTTPS to transport data.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-066",
        "questionText": "A programmer is using Ansible as the configuration management tool. Which term is used to describe a set of instructions for execution?",
        "explanation": "Ansible uses the name Playbook to describe the set of instructions to be executed.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Playbook",
                "IsCorrect": true
            },
            {
                "Text": "Pillar",
                "IsCorrect": false
            },
            {
                "Text": "Cookbook",
                "IsCorrect": false
            },
            {
                "Text": "Manifest",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-072",
        "questionText": "A technician is troubleshooting a network device and suspects there might be a duplex mismatch. What could cause a duplex mismatch?",
        "explanation": "Duplex mismatches are typically caused by a misconfigured interface or, in rare instances, by a failed autonegotiation. Duplex mismatches may be difficult to troubleshoot because the communication between devices still occurs.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "data corruption",
                "IsCorrect": false
            },
            {
                "Text": "interconnection of unlike devices",
                "IsCorrect": false
            },
            {
                "Text": "interface misconfiguration",
                "IsCorrect": true
            },
            {
                "Text": "auto-MDIX detection failure",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-073",
        "questionText": "A pharmaceutical company wants to contract the services of a cloud provider to store employee data and company-specific applications with strict access security. Which type of cloud would be the most appropriate for this scenario?",
        "explanation": "Private clouds – Cloud-based applications and services offered in a private cloud are intended for a specific organization or entity, such as the government. A private cloud can be set up using the organization’s private network, though this can be expensive to build and maintain. A private cloud can also be managed by an outside organization with strict access security.",
        "difficulty": "1",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "public cloud",
                "IsCorrect": false
            },
            {
                "Text": "private cloud",
                "IsCorrect": true
            },
            {
                "Text": "hybrid cloud",
                "IsCorrect": false
            },
            {
                "Text": "community cloud",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-083",
        "questionText": "What are two syntax rules for writing a JSON array? (Choose two.)",
        "explanation": "A JSON array is a collection of ordered values within square brackets [ ]. The values in the array are separated by a comma. For example “users” : [“bob”, “alice”, “eve”].",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Values are enclosed in square brackets.",
                "IsCorrect": true
            },
            {
                "Text": "A semicolon separates the key and list of values.",
                "IsCorrect": false
            },
            {
                "Text": "A space must separate each value in the array",
                "IsCorrect": false
            },
            {
                "Text": "Each value in the array is separated by a comma.",
                "IsCorrect": true
            },
            {
                "Text": "The array can include only one value type.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-091",
        "questionText": "What are three components used in the query portion of a typical RESTful API request? (Choose three.)",
        "explanation": "The query portion in a RESTful API request specifies the data format and information the client is requesting from the API service. Queries can include the following:\n* Format – JSON, YAML, XML, and other supported data format\n* Key – for authentication of the requesting source\n* Parameters – used to send information pertaining to the query request",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "resources",
                "IsCorrect": false
            },
            {
                "Text": "key",
                "IsCorrect": true
            },
            {
                "Text": "API server",
                "IsCorrect": false
            },
            {
                "Text": "format",
                "IsCorrect": true
            },
            {
                "Text": "parameters",
                "IsCorrect": true
            },
            {
                "Text": "protocol",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-092",
        "questionText": "Which two configuration management tools are developed using Python? (Choose two.)",
        "explanation": "Ansible and SaltStack are configuration management tools developed using Python. Chef and Puppet are configuration management tools developed using Ruby. Ruby is typically considered a more difficult language to learn than Python. NETCONF is a network management protocol.",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Puppet",
                "IsCorrect": false
            },
            {
                "Text": "Chef",
                "IsCorrect": false
            },
            {
                "Text": "Ansible",
                "IsCorrect": true
            },
            {
                "Text": "SaltStack",
                "IsCorrect": true
            },
            {
                "Text": "NETCONF",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "itn-pr-ex-ccna-135",
        "questionText": "What defines a two-tier spine-leaf topology?",
        "explanation": "In this two-tier topology, everything is one hop from everything else. The leaf switches (Cisco Nexus 9300) always attach to the spines (Cisco Nexus 9500), but never to each other. Similarly, the spine switches only attach to the leaf and core switches. The Cisco APICs and all other devices in the network physically attach to leaf switches. When compared to SDN, the APIC controller does not manipulate the data path directly.",
        "difficulty": "2",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Everything is two hops from everything else.",
                "IsCorrect": false
            },
            {
                "Text": "The spine tier can be implemented with Cisco Nexus 9500 switches connected to each other and to the leaf switches.",
                "IsCorrect": false
            },
            {
                "Text": "The APIC controller manipulates the data path directly.",
                "IsCorrect": false
            },
            {
                "Text": "The Cisco APICs and all other devices in the network physically attach to leaf switches.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-014",
        "questionText": "Which command allows a Cisco device to function as an NTP server without being an NTP client?",
        "explanation": "The ntp master command can be used to make the device function as an NTP server even if it isn’t an NTP client of another server. This command can be useful in isolated environments where an external NTP server isn’t available. It can also function as a backup; if the device loses connectivity to its NTP servers, it can still function as an NTP server and provide the time to its own clients.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "ntp master",
                "IsCorrect": true
            },
            {
                "Text": "ntp server",
                "IsCorrect": false
            },
            {
                "Text": "ntp primary-server",
                "IsCorrect": false
            },
            {
                "Text": "ntp primary",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-050",
        "questionText": "Which of the following Syslog severity level and IOS keyword pairs are correct? (select three)",
        "explanation": "Here are the Syslog severity levels in order: emergencies = 0, alerts = 1, critical = 2, errors = 3, warnings = 4, notifications = 5, informational = 6, debugging = 7.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "informational = 6",
                "IsCorrect": true
            },
            {
                "Text": "warnings = 3",
                "IsCorrect": false
            },
            {
                "Text": "errors = 4",
                "IsCorrect": false
            },
            {
                "Text": "alerts = 2",
                "IsCorrect": false
            },
            {
                "Text": "critical = 1",
                "IsCorrect": false
            },
            {
                "Text": "emergencies = 0",
                "IsCorrect": true
            },
            {
                "Text": "notifications = 5",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-082",
        "questionText": "Which scheduling method combines a priority queue with a weighted round-robin scheduler?",
        "explanation": "Low Latency Queuing (LLQ) combines a strict Priority Queue (PQ) for high-priority traffic with Class-Based Weighted Fair Queuing (CBWFQ) for other traffic classes, using a weighted round-robin scheduler.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "CBWFQ",
                "IsCorrect": false
            },
            {
                "Text": "PQ",
                "IsCorrect": false
            },
            {
                "Text": "EF",
                "IsCorrect": false
            },
            {
                "Text": "LLQ",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-144",
        "questionText": "Which of the following virtualization technologies is installed directly on server hardware?",
        "explanation": "A type 1 hypervisor is installed directly on server hardware, interacting directly with the physical hardware. Examples include VMware ESXi and Microsoft Hyper-V. Type 2 Hypervisors run on a host OS and are less efficient, suitable for testing or development. Containers offer OS-level virtualization, sharing the host’s kernel, but are not installed on server hardware directly.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Type 1 hypervisor",
                "IsCorrect": true
            },
            {
                "Text": "Type 2 hypervisor",
                "IsCorrect": false
            },
            {
                "Text": "Container",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-145",
        "questionText": "Which of the following statements about type-2 hypervisors is true?",
        "explanation": "A type-2 hypervisor runs on a host operating system rather than directly on the hardware. This makes it less efficient compared to a type-1 hypervisor, as it needs to go through the host OS to access hardware resources.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The hypervisor interacts directly with the hardware resources.",
                "IsCorrect": false
            },
            {
                "Text": "VMware ESXi is a popular type-2 hypervisor.",
                "IsCorrect": false
            },
            {
                "Text": "The hypervisor is installed on a host OS.",
                "IsCorrect": true
            },
            {
                "Text": "VMs running on a type-2 hypervisor don’t need to run their own OS.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-147",
        "questionText": "Which of the following cloud service models provides the most control to the customer?",
        "explanation": "The infrastructure as a service (IaaS) model provides the most control to the customer. The cloud service provider offers the underlying infrastructure, on top of which customers can install virtual machines (VMs), install OSs, run applications, etc, customizing the CPU, RAM, and storage for each VM and configuring their interconnections to form a network.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "PaaS",
                "IsCorrect": false
            },
            {
                "Text": "SaaS",
                "IsCorrect": false
            },
            {
                "Text": "IaaS",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-148",
        "questionText": "Which cloud service model offers a complete software product to the customer?",
        "explanation": "Software as a Service (SaaS) offers a complete software product to customers over the Internet. The software is hosted on cloud infrastructure, and users can typically access it through a web browser. Common examples are Microsoft 365 and Google Workspace.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "PaaS",
                "IsCorrect": false
            },
            {
                "Text": "SaaS",
                "IsCorrect": true
            },
            {
                "Text": "IaaS",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-149",
        "questionText": "AWS, Azure, and GCP are examples of what cloud deployment model?",
        "explanation": "Amazon Web Services (AWS), Microsoft Azure, and Google Cloud Platform (GCP) are examples of public cloud providers. They offer cloud resources over the internet, available for open use by the public (for a fee).",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Commercial cloud",
                "IsCorrect": false
            },
            {
                "Text": "Private cloud",
                "IsCorrect": false
            },
            {
                "Text": "Public cloud",
                "IsCorrect": true
            },
            {
                "Text": "Hybrid cloud",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-150",
        "questionText": "Which of the following are advantages of cloud computing? (select two)",
        "explanation": "Cloud computing offers reduced capital expenditure (CapEx)—upfront costs—as it minimizes the need for physical hardware investments. Additionally, cloud computing simplifies global scaling, allowing businesses to quickly expand their computing resources over the globe as needed.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Reduced CapEx",
                "IsCorrect": true
            },
            {
                "Text": "Reduced OpEx",
                "IsCorrect": false
            },
            {
                "Text": "Greater control over infrastructure",
                "IsCorrect": false
            },
            {
                "Text": "Simplified global scaling",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-151",
        "questionText": "In the context of cloud computing, what is rapid elasticity?",
        "explanation": "Rapid elasticity is a key feature of cloud computing, enabling businesses to quickly scale their IT resources up or down based on their current requirements.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Measuring and charging based on each customer’s use of resources",
                "IsCorrect": false
            },
            {
                "Text": "The ability to deploy cloud resource with a self-service model",
                "IsCorrect": false
            },
            {
                "Text": "The ability to flexibly scale infrastructure according to need",
                "IsCorrect": true
            },
            {
                "Text": "The ability to flexibly connect to cloud infrastructure via a variety of connection methods",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-152",
        "questionText": "In which model do customers rent space, cooling, electricity, etc, in a shared data center?",
        "explanation": "In colocation services, customers rent space, cooling, electricity, and other data center resources in a shared facility. They typically own the hardware and are responsible for managing their equipment within the data center.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "SaaS",
                "IsCorrect": false
            },
            {
                "Text": "IaaS",
                "IsCorrect": false
            },
            {
                "Text": "Colocation",
                "IsCorrect": true
            },
            {
                "Text": "On-prem",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-153",
        "questionText": "Which of the following virtualization technologies is more lightweight, using fewer hardware resources?",
        "explanation": "Containers are more lightweight and use fewer hardware resources compared to Virtual Machines (VMs). They share the host system’s kernel and do not require a full operating system for each instance, which significantly reduces their overhead.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "A container",
                "IsCorrect": true
            },
            {
                "Text": "A VM running on a type-1 hypervisor",
                "IsCorrect": false
            },
            {
                "Text": "A VM running on a type-2 hypervisor",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-178",
        "questionText": "Which of the following is not a benefit of cloud-based network management?",
        "explanation": "While cloud-based network management provides a variety of benefits such as rapid deployment with zero-touch provisioning (ZTP), simplified management via a web-based dashboard, and enhanced network visibility and analytics, it might not be suitable for organizations with highly specialized or complex network requirements.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Rapid deployment with ZTP",
                "IsCorrect": false
            },
            {
                "Text": "Highly customizable to meet complex networking requirements",
                "IsCorrect": true
            },
            {
                "Text": "Simplified management via a web-based dashboard",
                "IsCorrect": false
            },
            {
                "Text": "Enhanced visibility and analytics",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-202",
        "questionText": "Which logical plane is responsible for routers exchanging BGP messages with each other to share routing information and build their routing tables?",
        "explanation": "The Control Plane is responsible for the exchange of routing protocol messages, like BGP, between routers. This plane handles the logic needed to build and maintain routing tables and other tables necessary for forwarding messages.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Management Plane",
                "IsCorrect": false
            },
            {
                "Text": "Control Plane",
                "IsCorrect": true
            },
            {
                "Text": "Data Plane",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-203",
        "questionText": "Which logical plane is responsible for a switch examining the source MAC address of each frame it receives and creating MAC address table entries?",
        "explanation": "The Control Plane in a switch is responsible for examining the source MAC addresses of incoming frames and creating MAC address table entries, which are used for making forwarding decisions. The forwarding decisions themselves are the role of the Data Plane.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Management Plane",
                "IsCorrect": false
            },
            {
                "Text": "Control Plane",
                "IsCorrect": true
            },
            {
                "Text": "Data Plane",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-204",
        "questionText": "Which logical plane is responsible for a switch examining the destination MAC address of each frame it receives and making a forwarding/flooding decision?",
        "explanation": "The Data Plane (or Forwarding Plane) in a switch is responsible for examining the destination MAC addresses of incoming frames and making forwarding or flooding decisions based on this information. Any activities related to the actual forwarding of messages are the responsibility of the Data Plane.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Management Plane",
                "IsCorrect": false
            },
            {
                "Text": "Control Plane",
                "IsCorrect": false
            },
            {
                "Text": "Data Plane",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-205",
        "questionText": "Which of the following planes are distributed in a traditional (non-SDN) network? (select all that apply)",
        "explanation": "In a traditional network architecture, all three planes are distributed. Each network device is managed individually, builds its own tables for forwarding traffic, and makes independent forwarding decisions.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Management Plane",
                "IsCorrect": true
            },
            {
                "Text": "Control Plane",
                "IsCorrect": true
            },
            {
                "Text": "Data Plane",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-206",
        "questionText": "Which of the following statements about SDN architecture are true? (select two)",
        "explanation": "In software-defined networking (SDN) architecture, the Data Plane remains distributed; each network device is responsible for forwarding messages across the network. The Control Plane, on the other hand, is centralized in the SDN controller, which is responsible for providing instructions about how to forward messages to the network devices.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The Data Plane is distributed",
                "IsCorrect": true
            },
            {
                "Text": "The Control Plane is distributed",
                "IsCorrect": false
            },
            {
                "Text": "The Data Plane is centralized",
                "IsCorrect": false
            },
            {
                "Text": "The Control Plane is centralized",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-207",
        "questionText": "Which type of API is most common in the NBI of SDN architecture?",
        "explanation": "In the northbound interface (NBI) of an SDN controller, representational state transfer (REST) APIs are commonly used, allowing applications to programmatically interact with the controller.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "OpenFlow",
                "IsCorrect": false
            },
            {
                "Text": "REST",
                "IsCorrect": true
            },
            {
                "Text": "NETCONF",
                "IsCorrect": false
            },
            {
                "Text": "OpFlex",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-208",
        "questionText": "Which SDN interface is used to communicate with the managed devices?",
        "explanation": "The southbound interface (SBI) of an SDN controller is used to communicate with the managed devices. The name comes from how SDN architecture is usually illustrated, with the Application Layer at the top, the Control Layer in the middle, and the Infrastructure Layer (where the managed devices are located) at the bottom.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "NBI",
                "IsCorrect": false
            },
            {
                "Text": "SBI",
                "IsCorrect": true
            },
            {
                "Text": "HTTP",
                "IsCorrect": false
            },
            {
                "Text": "Application",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-209",
        "questionText": "Which SDN architecture layer contains the network devices responsible for forwarding messages across the network?",
        "explanation": "The Infrastructure Layer in SDN architecture contains the physical and virtual network devices responsible for forwarding messages across the network. This layer is where the Data Plane’s forwarding of messages takes place.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Application Layer",
                "IsCorrect": false
            },
            {
                "Text": "Transport Layer",
                "IsCorrect": false
            },
            {
                "Text": "Control Layer",
                "IsCorrect": false
            },
            {
                "Text": "Infrastructure Layer",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-210",
        "questionText": "Which Cisco SDN solution takes advantage of spine-leaf architecture?",
        "explanation": "Cisco’s Application-Centric Infrastructure (ACI) uses a spine-leaf architecture, optimizing east-west communication between servers in a data center.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "ACI",
                "IsCorrect": true
            },
            {
                "Text": "SD-Access",
                "IsCorrect": false
            },
            {
                "Text": "SD-WAN",
                "IsCorrect": false
            },
            {
                "Text": "SD-DC",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-211",
        "questionText": "Which of the following are Management Layer protocols? (select two)",
        "explanation": "Secure Shell (SSH) and Network Time Protocol (NTP) are protocols used in the management layer of network systems. SSH provides secure access to the CLI of network devices, and NTP ensures accurate time synchronization across the network.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "SSH",
                "IsCorrect": true
            },
            {
                "Text": "NTP",
                "IsCorrect": true
            },
            {
                "Text": "STP",
                "IsCorrect": false
            },
            {
                "Text": "ARP",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-212",
        "questionText": "Which of the following is not a benefit of network automation?",
        "explanation": "While network automation can lead to reduced operating expenses (OpEx) through efficiency and reduced human error, it doesn’t directly lead to reduced (capital expenses (CapEx). CapEx is typically associated with investments in equipment and infrastructure.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Reduced human error",
                "IsCorrect": false
            },
            {
                "Text": "Reduced time to configure devices",
                "IsCorrect": false
            },
            {
                "Text": "Reduced OpEx",
                "IsCorrect": false
            },
            {
                "Text": "Reduced CapEx",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-213",
        "questionText": "Which type of machine learning involves labeled data sets?",
        "explanation": "Supervised learning is a type of machine learning (and deep learning) that involves labeled data sets. This is highly effective when clear and accurate labels are available, enabling precise predictions and classifications.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Supervised learning",
                "IsCorrect": true
            },
            {
                "Text": "Unsupervised learning",
                "IsCorrect": false
            },
            {
                "Text": "Reinforcement learning",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-214",
        "questionText": "Which of the following can be provided by predictive AI?",
        "explanation": "AI models can analyze network traffic to predict future network load, allowing for proactive provisioning of additional resources or QoS policy optimization.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Device configuration generation",
                "IsCorrect": false
            },
            {
                "Text": "Automated network diagrams",
                "IsCorrect": false
            },
            {
                "Text": "Network traffic forecasting",
                "IsCorrect": true
            },
            {
                "Text": "Automated network design",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-215",
        "questionText": "Which Catalyst Center AI feature can be used to automate troubleshooting?",
        "explanation": "Catalyst Center’s Machine reasoning (MR) engine automates network troubleshooting, performing a root cause analysis when issues arise and potentially resolving problems without requiring manual intervention.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Machine reasoning",
                "IsCorrect": true
            },
            {
                "Text": "AI endpoint analytics",
                "IsCorrect": false
            },
            {
                "Text": "AI enhanced RRM",
                "IsCorrect": false
            },
            {
                "Text": "AI remediation",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-216",
        "questionText": "Which HTTP method is generally equivalent to a CRUD “create” operation?",
        "explanation": "The HTTP POST method is generally equivalent to a CRUD “create” operation. It is used to create a new resource on the server.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "PUT",
                "IsCorrect": false
            },
            {
                "Text": "PATCH",
                "IsCorrect": false
            },
            {
                "Text": "POST",
                "IsCorrect": true
            },
            {
                "Text": "GET",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-217",
        "questionText": "Which HTTP methods are generally equivalent to a CRUD “update” operation? (select two)",
        "explanation": "The HTTP PUT and PATCH methods are generally equivalent to a CRUD “update” operation. PUT is used to replace a resource, and PATCH is used to modify a resource.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "PUT",
                "IsCorrect": true
            },
            {
                "Text": "PATCH",
                "IsCorrect": true
            },
            {
                "Text": "POST",
                "IsCorrect": false
            },
            {
                "Text": "GET",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-218",
        "questionText": "Which HTTP method is used to replace the specified resource?",
        "explanation": "The PUT HTTP method is generally used to replace the specified resource entirely. If the specified resource does not exist, it may be created using PUT.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "PUT",
                "IsCorrect": true
            },
            {
                "Text": "PATCH",
                "IsCorrect": false
            },
            {
                "Text": "POST",
                "IsCorrect": false
            },
            {
                "Text": "GET",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-219",
        "questionText": "Which HTTP response code indicates that the request resource was not found?",
        "explanation": "The 404 “Not Found” HTTP response code indicates that the requested resource was not found on the server.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "200",
                "IsCorrect": false
            },
            {
                "Text": "201",
                "IsCorrect": false
            },
            {
                "Text": "403",
                "IsCorrect": false
            },
            {
                "Text": "404",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-220",
        "questionText": "Which of the following HTTP response code classes are correct? (select three)",
        "explanation": "1xx codes are informational, 2xx codes indicate successful responses, and 3xx codes indicate that further action needs to be taken to complete the request. The remaining classes are 4xx for client errors and 5xx for server errors.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "2xx = successful",
                "IsCorrect": true
            },
            {
                "Text": "4xx = server error",
                "IsCorrect": false
            },
            {
                "Text": "5xx = client error",
                "IsCorrect": false
            },
            {
                "Text": "1xx = informational",
                "IsCorrect": true
            },
            {
                "Text": "3xx = redirection",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-221",
        "questionText": "Which of the following statements about REST APIs are true? (select two)",
        "explanation": "REST APIs are stateless, meaning that each request is a separate event, independent of all past exchanges between the client and server. Each request from the client must contain all the information needed to understand and process the request. REST is based on a client-server architecture in which the client and server are independent of each other.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "REST APIs are stateful.",
                "IsCorrect": false
            },
            {
                "Text": "REST APIs are stateless.",
                "IsCorrect": true
            },
            {
                "Text": "REST uses a client-server architecture.",
                "IsCorrect": true
            },
            {
                "Text": "REST uses a peer-to-peer architecture.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-222",
        "questionText": "Which statement about caching is accurate with regard to REST APIs?",
        "explanation": "In REST APIs, resources can be cacheable or non-cacheable, but they must be explicitly or implicitly marked as such.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Resources must be marked as cacheable or non-cacheable.",
                "IsCorrect": true
            },
            {
                "Text": "Resources are never cacheable.",
                "IsCorrect": false
            },
            {
                "Text": "Resources must be cacheable.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-223",
        "questionText": "Which of the following HTTP response codes indicates a successful request?",
        "explanation": "The 200 “OK” HTTP response code indicates a successful request. This response code is commonly used to indicate that a GET, PUT, POST, or PATCH request was successfully processed.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "102",
                "IsCorrect": false
            },
            {
                "Text": "200",
                "IsCorrect": true
            },
            {
                "Text": "301",
                "IsCorrect": false
            },
            {
                "Text": "500",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-224",
        "questionText": "Which REST API authentication method allows a client to access a resource on a server on behalf of the resource’s owner?",
        "explanation": "OAuth 2.0 is designed to allow third-party applications to access resources on behalf of the resource owner without sharing the owner’s credentials. The resource owner grants authorization to the third-party client application, which uses the authorization grant to obtain an access token. This token allows the client to access the resource on behalf of the owner.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "OAuth 2.0",
                "IsCorrect": true
            },
            {
                "Text": "Basic authentication",
                "IsCorrect": false
            },
            {
                "Text": "API key authentication",
                "IsCorrect": false
            },
            {
                "Text": "Bearer authentication",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-225",
        "questionText": "In which REST API authentication method does a client authenticate with an authorization server to receive a token that the client includes in its API calls?",
        "explanation": "In bearer authentication, the client authenticates with an authorization server to obtain an access token, which it includes in its API calls to access protected resources. The access token is typically short-lived, requiring regular renewal for continued access.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "OAuth 2.0",
                "IsCorrect": false
            },
            {
                "Text": "Basic authentication",
                "IsCorrect": false
            },
            {
                "Text": "API key authentication",
                "IsCorrect": false
            },
            {
                "Text": "Bearer authentication",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-226",
        "questionText": "What is the primary advantage of using OAuth 2.0 for accessing resources?",
        "explanation": "OAuth 2.0 provides a secure way to delegate access to resources by issuing tokens, thereby eliminating the need to share the user’s credentials with third-party applications. OAuth 2.0 is a key component of many modern web applications.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "OAuth 2.0 requires no client-side implementation.",
                "IsCorrect": false
            },
            {
                "Text": "OAuth 2.0 allows third-party applications to access resources without sharing the user’s credentials.",
                "IsCorrect": true
            },
            {
                "Text": "OAuth 2.0 tokens do not expire.",
                "IsCorrect": false
            },
            {
                "Text": "OAuth 2.0 is easier to implement than basic authentication.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-227",
        "questionText": "In which data serialization language is whitespace significant?",
        "explanation": "In YAML (YAML Ain’t Markup Language), whitespace (specifically, indentation) is significant and is used to denote structure of the data. In XML (Extensible Markup Language) and JSON (JavaScript Object Notation), whitespace is not significant for the structure of the data.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "XML",
                "IsCorrect": false
            },
            {
                "Text": "YAML",
                "IsCorrect": true
            },
            {
                "Text": "JSON",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-228",
        "questionText": "Which data serialization language uses HTML-like tags?",
        "explanation": "XML uses HTML-like tags to indicate key-value pairs: <key>value</key>.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "XML",
                "IsCorrect": true
            },
            {
                "Text": "YAML",
                "IsCorrect": false
            },
            {
                "Text": "JSON",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-229",
        "questionText": "What is the JSON name for an unordered set of key-value pairs?",
        "explanation": "In JSON, an unordered set of key-value pairs is known as an “object”. It is enclosed in curly braces, with keys and values separated by colons.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Array",
                "IsCorrect": false
            },
            {
                "Text": "List",
                "IsCorrect": false
            },
            {
                "Text": "Item",
                "IsCorrect": false
            },
            {
                "Text": "Object",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-230",
        "questionText": "Which statements are true about the following JSON data? (select two) {\"interface_name\":\"GigabitEthernet1/1\",\"is_up\":\"true\",\"speed\":1000}",
        "explanation": "The value of \"speed\" is a numeric value that is not enclosed in double quotes, so it is a JSON number. The data as a whole is a JSON object—a set of key-value pairs enclosed in curly braces.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The value of “is_up” is a JSON boolean.",
                "IsCorrect": false
            },
            {
                "Text": "The value of “speed” is a JSON number.",
                "IsCorrect": true
            },
            {
                "Text": "The data is a JSON object.",
                "IsCorrect": true
            },
            {
                "Text": "The data is a JSON array.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-231",
        "questionText": "Which of the following statements about JSON arrays are true? (select two)",
        "explanation": "A JSON array is an ordered set of values enclosed in square brackets. The values can be of any valid JSON data type (including another array), but don’t all have to be of the same data type. The values are separated by commas, but there must not be a trailing comma.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Arrays are enclosed in square brackets.",
                "IsCorrect": true
            },
            {
                "Text": "There can be a trailing comma.",
                "IsCorrect": false
            },
            {
                "Text": "The values don’t have to be of the same data type.",
                "IsCorrect": true
            },
            {
                "Text": "The value can be of any valid JSON data type except another array.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-232",
        "questionText": "Which of the following statements about JSON objects are true? (select two)",
        "explanation": "A JSON object is an unordered set of key-value pairs enclosed in curly braces. The key of each pair must be a string, and the value can be any valid JSON data type (including another object). The key and value of each pair are separated by a colon, and each pair is separated by a comma, but there must not be a trailing comma.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "The key of each key-value pair must be a string.",
                "IsCorrect": true
            },
            {
                "Text": "The value of each key-value pair can be any valid JSON data type except another object.",
                "IsCorrect": false
            },
            {
                "Text": "There must not be a trailing comma.",
                "IsCorrect": true
            },
            {
                "Text": "Objects are enclosed in square brackets.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-233",
        "questionText": "Which statement about the following JSON data is true? {\"device\":\"Switch01\",\"location\":\"DataCenterA\",\"uptime\":\"72 hours\",\"ports_active\":24}",
        "explanation": "There are no missing commas, extra colons, or any other elements that would make this data invalid; it is valid JSON data.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It is valid JSON data.",
                "IsCorrect": true
            },
            {
                "Text": "A comma is missing.",
                "IsCorrect": false
            },
            {
                "Text": "The whitespace formatting is invalid.",
                "IsCorrect": false
            },
            {
                "Text": "There is an extra colon.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-234",
        "questionText": "Which of the following are valid JSON strings? (select all that apply)",
        "explanation": "A JSON string is an alphanumeric text value enclosed in double quotes. This applies to values that would otherwise be of a different data type without quotes: \"true\" would be a JSON boolean without double quotes, and \"1000\" would be a JSON number.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "'Hello.'",
                "IsCorrect": false
            },
            {
                "Text": "\"Acing The CCNA Exam\"",
                "IsCorrect": true
            },
            {
                "Text": "\"true\"",
                "IsCorrect": true
            },
            {
                "Text": "True or false",
                "IsCorrect": false
            },
            {
                "Text": "\"1000\"",
                "IsCorrect": true
            },
            {
                "Text": "null",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-235",
        "questionText": "Which of the following statements about Ansible are true? (select two)",
        "explanation": "Ansible is written in Python and employs an agentless model in which it uses SSH (TCP port 22) to connect to managed devices. Unlike Puppet and Chef, Ansible uses a push model; the Ansible control node pushes configurations to managed devices, instead of managed devices retrieving configurations from the control node.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Ansible is written in Python.",
                "IsCorrect": true
            },
            {
                "Text": "Ansible uses an agent-based model.",
                "IsCorrect": false
            },
            {
                "Text": "Ansible uses a pull model.",
                "IsCorrect": false
            },
            {
                "Text": "The Ansible control node connects to port 22 of managed devices.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-236",
        "questionText": "Which of the following statements about Puppet are true? (select two)",
        "explanation": "Puppet is written in Ruby. Unlike Ansible and Terraform, Puppet is agent-based and employs a pull model in which the Puppet agent on managed devices connects to the REST API on the Puppet master to retrieve configurations.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Puppet is written in Ruby.",
                "IsCorrect": true
            },
            {
                "Text": "Puppet is written in Python.",
                "IsCorrect": false
            },
            {
                "Text": "Puppet uses a pull model.",
                "IsCorrect": true
            },
            {
                "Text": "Puppet uses a push model.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-237",
        "questionText": "Which language are most Ansible files written in?",
        "explanation": "Most Ansible files, including inventory and playbook files, are written in YAML, which is popular for its readability and ease of use.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Python",
                "IsCorrect": false
            },
            {
                "Text": "YAML",
                "IsCorrect": true
            },
            {
                "Text": "JSON",
                "IsCorrect": false
            },
            {
                "Text": "Ruby",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-238",
        "questionText": "Which of the following statements about Chef are true? (select two)",
        "explanation": "Like Puppet, Chef is agent-based and requires an agent called the “Chef client” to be installed on managed devices. It also uses a pull model, in which the Chef client connects to the Chef server’s REST API to retrieve configurations.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Chef is written in Python.",
                "IsCorrect": false
            },
            {
                "Text": "Chef uses a pull model.",
                "IsCorrect": true
            },
            {
                "Text": "A Chef client must be installed on managed devices.",
                "IsCorrect": true
            },
            {
                "Text": "Chef uses an agentless model.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-239",
        "questionText": "Which of these IaC tools are primarily used for configuration management? (select three)",
        "explanation": "Of these four infrastructure as code (IaC) tools, Ansible, Chef, and Puppet are primarily used for configuration management, whereas Terraform is primarily used as a provisioning tool.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Ansible",
                "IsCorrect": true
            },
            {
                "Text": "Chef",
                "IsCorrect": true
            },
            {
                "Text": "Terraform",
                "IsCorrect": false
            },
            {
                "Text": "Puppet",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-240",
        "questionText": "Which statements about HashiCorp Configuration Language are true? (select two)",
        "explanation": "Terraform uses HashiCorp Configuration Language (HCL), a domain-specific language (DSL)—a type of computer language specialized for a particular purpose, unlike general-purpose languages like Python or Go. HCL is declarative, meaning that it specifies the desired outcome rather than the specific procedures to achieve that outcome. It can often perform complex tasks with much less effort than a general language would require.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It is more flexible than a language like Python or Go.",
                "IsCorrect": false
            },
            {
                "Text": "It can perform complex tasks with less effort than general languages.",
                "IsCorrect": true
            },
            {
                "Text": "It is a declarative language.",
                "IsCorrect": true
            },
            {
                "Text": "It is a procedural language.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-241",
        "questionText": "Which of the following configuration management tools use an agent-based model? (select two)",
        "explanation": "Both Puppet and Chef use an agent-based model where agents installed on managed devices communicate with a central server (Puppet master or Chef server) to retrieve configuration information and apply it.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Puppet",
                "IsCorrect": true
            },
            {
                "Text": "Ansible",
                "IsCorrect": false
            },
            {
                "Text": "Chef",
                "IsCorrect": true
            },
            {
                "Text": "Terraform",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-242",
        "questionText": "Which Ansible file defines automation tasks to manage configuration on managed devices?",
        "explanation": "In Ansible, playbooks are the primary files where automation tasks are defined. Playbooks are written in YAML and describe the configurations of managed devices.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Template",
                "IsCorrect": false
            },
            {
                "Text": "Module",
                "IsCorrect": false
            },
            {
                "Text": "Playbook",
                "IsCorrect": true
            },
            {
                "Text": "Run-list",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-243",
        "questionText": "Which of the following statements about Terraform are true? (select two)",
        "explanation": "Terraform is an IaC tool written in the Go programming language. It primarily uses a declarative approach, in which you define the desired end state for the infrastructure rather than specifying the step-by-step instructions for how to achieve that desited state.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Terraform uses a pull model.",
                "IsCorrect": false
            },
            {
                "Text": "Terraform primarily uses a declarative approach.",
                "IsCorrect": true
            },
            {
                "Text": "Terraform requires a software agent on managed devices.",
                "IsCorrect": false
            },
            {
                "Text": "Terraform is written in Go.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "jit-bk-2-244",
        "questionText": "What are the three steps in the basic Terraform workflow?",
        "explanation": "The basic Terraform workflow consists of three main steps. The first is write, in which you define the desired state of your infrastructure resources in configuration files using HCL. The second is plan, in which you verify the changes that will be executed. The third is apply, in which you execute the plan to provision and manage the infrastructure resources.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Write, execute, review",
                "IsCorrect": false
            },
            {
                "Text": "Write, plan, apply",
                "IsCorrect": true
            },
            {
                "Text": "Create, apply, troubleshoot",
                "IsCorrect": false
            },
            {
                "Text": "Plan, write, execute",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-034",
        "questionText": "In which way does a spine-and-leaf architecture allow for scalability in a network when additional access ports are required?",
        "explanation": "Spine-leaf architecture is typically deployed as two layers: spines (such as an aggregation layer), and leaves (such as an access layer). Spine-leaf topologies provide high-bandwidth, low-latency, non-blocking server-to-server connectivity. Leaf (aggregation) switches are what provide devices access to the fabric (the network of spine and leaf switches) and are typically deployed at the top of the rack. Generally, devices connect to the leaf switches. Devices can include servers, Layer 4-7 services (firewalls and load balancers), and WAN or Internet routers. Leaf switches do not connect to other leaf switches. In spine-and-leaf architecture, every leaf should connect to every spine in a full mesh. Spine (aggregation) switches are used to connect to all leaf switches and are typically deployed at the end or middle of the row. Spine switches do not connect to other spine switches.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "A spine switch and a leaf switch can be added with redundant connections between them",
                "IsCorrect": false
            },
            {
                "Text": "A spine switch can be added with at least 40 GB uplinks",
                "IsCorrect": false
            },
            {
                "Text": "A leaf switch can be added with a single connection to a core spine switch.",
                "IsCorrect": false
            },
            {
                "Text": "A leaf switch can be added with connections to every spine switch",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-116",
        "questionText": "What is a global command?",
        "explanation": "When you enter global configuration mode and enter a command, it is applied to the running configuration file that is currently running in ram. The configuration of a global command affects the entire router. An example of a global command is one used for the hostname of the router.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "a command that is set once and affects the entire router",
                "IsCorrect": true
            },
            {
                "Text": "a command that is implemented in all foreign and domestic IOS versions",
                "IsCorrect": false
            },
            {
                "Text": "a command that is universal in application and supports all protocols",
                "IsCorrect": false
            },
            {
                "Text": "a command that is available in every release of IOS, regardless of the version or deployment status",
                "IsCorrect": false
            },
            {
                "Text": "a command that can be entered in any configuration mode",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-192",
        "questionText": "Before installing a new, upgraded version of the IOS, what should be checked on the router, and which command should be used to gather this information? (Choose two.)",
        "explanation": "When upgrading a new version of the IOS we need to copy the IOS to the Flash so first we have to check if the Flash has enough memory or not. Also running the new IOS may require more RAM than the older one so we should check the available RAM too. We can check both with the “show version” command.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "the amount of available ROM",
                "IsCorrect": false
            },
            {
                "Text": "the amount of available flash and RAM memory",
                "IsCorrect": true
            },
            {
                "Text": "the version of the bootstrap software present on the router",
                "IsCorrect": false
            },
            {
                "Text": "show version",
                "IsCorrect": true
            },
            {
                "Text": "show processes",
                "IsCorrect": false
            },
            {
                "Text": "show running-config",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-256",
        "questionText": "What are the three things that the Netflow uses to consider the traffic to be in a same flow? (Choose three)",
        "explanation": "What is an IP Flow?",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "IP address",
                "IsCorrect": true
            },
            {
                "Text": "Interface name",
                "IsCorrect": false
            },
            {
                "Text": "Port numbers",
                "IsCorrect": true
            },
            {
                "Text": "L3 protocol type",
                "IsCorrect": true
            },
            {
                "Text": "MAC address",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-258",
        "questionText": "What are the benefits of using Netflow? (Choose three.)",
        "explanation": "NetFlow traditionally enables several key customer applications including:",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Network, Application & User Monitoring",
                "IsCorrect": true
            },
            {
                "Text": "Network Planning",
                "IsCorrect": false
            },
            {
                "Text": "Security Analysis",
                "IsCorrect": true
            },
            {
                "Text": "Accounting/Billing",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-260",
        "questionText": "What are three factors a network administrator must consider before implementing Netflow in the network? (Choose three.)",
        "explanation": "NetFlow has a reputation for increasing CPU utilization on your network devices. Cisco’s performance testing seems to indicate that newer hardware can accommodate this load pretty well, but you will still want to check it out before you turn on the feature. Some symptoms of high CPU utilization are very large jitter and increased delay. Services running\non the device may also be affected.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "CPU utilization",
                "IsCorrect": true
            },
            {
                "Text": "where Netflow data will be sent",
                "IsCorrect": true
            },
            {
                "Text": "number of devices exporting Netflow data",
                "IsCorrect": true
            },
            {
                "Text": "port availability",
                "IsCorrect": false
            },
            {
                "Text": "SNMP version",
                "IsCorrect": false
            },
            {
                "Text": "WAN encapsulation",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-261",
        "questionText": "What are three values that must be the same within a sequence of packets for Netflow to consider them a network flow? (Choose three.)",
        "explanation": "Each packet that is forwarded within a router or switch is examined for a set of IP packet attributes. These attributes are the IP packet identity or fingerprint of the packet and determine if the packet is unique or similar to other packets.\nTraditionally, an IP Flow is based on a set of 5 and up to 7 IP packet attributes.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "source IP address",
                "IsCorrect": true
            },
            {
                "Text": "source MAC address",
                "IsCorrect": false
            },
            {
                "Text": "egress interface",
                "IsCorrect": false
            },
            {
                "Text": "ingress interface",
                "IsCorrect": true
            },
            {
                "Text": "destination IP address",
                "IsCorrect": true
            },
            {
                "Text": "IP next-hop",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-262",
        "questionText": "What command visualizes the general NetFlow data on the command line?",
        "explanation": "The following is an example of how to visualize the NetFlow data using the CLI. There are three methods to visualize the data depending on the version of Cisco IOS Software.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [
            {
                "ExhibitId": "ccnap-262-exhibit-1",
                "ExhibitTitle": "Exhibit 1",
                "ExhibitFileName": "https://ccnapremium.com/wp-content/uploads/2016/07/CISCO-CCNA-Exam-%E2%80%93-Q269.jpg"
            }
        ],
        "answerChoices": [
            {
                "Text": "show ip flow export",
                "IsCorrect": false
            },
            {
                "Text": "show ip flow top-talkers",
                "IsCorrect": false
            },
            {
                "Text": "show ip cache flow",
                "IsCorrect": true
            },
            {
                "Text": "show mls sampling",
                "IsCorrect": false
            },
            {
                "Text": "show mls netflow ip",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-263",
        "questionText": "What Cisco IOS feature can be enabled to pinpoint an application that is causing slow network performance?",
        "explanation": "Netflow can be used to diagnose slow network performance, bandwidth hogs and bandwidth utilization quickly with command line interface or reporting tools.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "SNMP",
                "IsCorrect": false
            },
            {
                "Text": "Netflow",
                "IsCorrect": true
            },
            {
                "Text": "WCCP",
                "IsCorrect": false
            },
            {
                "Text": "IP SLA",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-264",
        "questionText": "What Netflow component can be applied to an interface to track IPv4 traffic?",
        "explanation": "Flow monitors are the Flexible NetFlow component that is applied to interfaces to perform network traffic monitoring. Flow monitors consist of a record and a cache. You add the record to the flow monitor after you create the flow monitor. The flow monitor cache is automatically created at the time the flow monitor is applied to the first interface. Flow data is collected from the network traffic during the monitoring process based on the key and non-key fields in the record, which is configured for the flow monitor and stored in the flow monitor cache.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "flow monitor",
                "IsCorrect": true
            },
            {
                "Text": "flow record",
                "IsCorrect": false
            },
            {
                "Text": "flow sampler",
                "IsCorrect": false
            },
            {
                "Text": "flow exporter",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "ccnap-265",
        "questionText": "What are three reasons to collect Netflow data on a company network? (Choose three.)",
        "explanation": "NetFlow facilitates solutions to many common problems encountered by IT professionals.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "To identify applications causing congestion.",
                "IsCorrect": true
            },
            {
                "Text": "To authorize user network access.",
                "IsCorrect": false
            },
            {
                "Text": "To report and alert link up / down instances.",
                "IsCorrect": false
            },
            {
                "Text": "To diagnose slow network performance, bandwidth hogs, and bandwidth utilization.",
                "IsCorrect": true
            },
            {
                "Text": "To detect suboptimal routing in the network.",
                "IsCorrect": false
            },
            {
                "Text": "To confirm the appropriate amount of bandwidth that has been allocated to each Class of Service.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-008",
        "questionText": "What is a key characteristic of an \"Intent-Based Network\" (IBN) as promoted by Cisco DNA Center?",
        "explanation": "An **Intent-Based Network (IBN)** fundamentally shifts network management from device-centric, manual configuration to an automated, policy-driven approach aligned with business objectives.\n\n- IBN focuses on **translating high-level business intent into network policies and automated network actions**. This means you define *what* the network should do (e.g., 'ensure critical application traffic has priority'), and the IBN system (like Cisco DNA Center) automatically configures the network to achieve that intent.\n- It aims to **reduce reliance on manual CLI configuration** and leverages automation for provisioning, configuration, management, and optimization.\n- While IBN can integrate with virtualization and enhance security, its main goal isn't solely VNF replacement or specific security isolation.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "IBN primarily relies on manual, command-line interface (CLI) based configuration for network management.",
                "IsCorrect": false
            },
            {
                "Text": "IBN focuses on translating high-level business intent into network policies and automated network actions.",
                "IsCorrect": true
            },
            {
                "Text": "IBN's main goal is to replace all physical network devices with virtualized network functions (VNFs) in the cloud.",
                "IsCorrect": false
            },
            {
                "Text": "IBN prioritizes network security by completely isolating network control and data planes for enhanced threat protection.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-011",
        "questionText": "Which of the following components are typically part of a controller-based, software-defined networking (SDN) architecture? (Select all that apply.)",
        "explanation": "A controller-based SDN architecture centralizes network intelligence and control. Key components include:\n\n- **Underlay network:** The physical infrastructure (routers, switches, cables) providing basic connectivity.\n- **Overlay network:** A virtualized layer built on top of the underlay, abstracting physical details and creating virtual networks.\n- **Network fabric:** An integrated environment combining the physical underlay with the logical overlay for seamless connectivity.\n- **A central controller:** Orchestrates and manages network policies, providing centralized control.\n\nIn SDN, the control plane is *decoupled* from individual network devices and centralized in the controller, so a **distributed control plane embedded in each network device** (as in traditional networks) is generally *not* a characteristic of controller-based SDN.",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Underlay network, providing the physical connectivity.",
                "IsCorrect": true
            },
            {
                "Text": "Overlay network, which creates virtualized network services atop the physical network.",
                "IsCorrect": true
            },
            {
                "Text": "Network fabric, integrating physical and virtual components for seamless connectivity.",
                "IsCorrect": true
            },
            {
                "Text": "Distributed control plane embedded in each network device.",
                "IsCorrect": false
            },
            {
                "Text": "A central controller that orchestrates and manages network policies.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-016",
        "questionText": "Which API in an SDN architecture is used by applications to interact with the controller?",
        "explanation": "In Software-Defined Networking (SDN) architectures, APIs facilitate communication between different layers:\n\n- **Northbound API:** This interface allows **applications and orchestration systems (higher-level)** to communicate with and make requests to the **SDN controller**. It provides an abstract view of the network, enabling applications to define policies and query network state without knowing low-level device details.\n- **Southbound API:** This interface is used by the **SDN controller** to communicate with and push configurations/instructions to the **network devices (switches, routers)**. OpenFlow is a common example.\n\nTherefore, applications interact with the controller via the Northbound API.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Southbound API",
                "IsCorrect": false
            },
            {
                "Text": "Eastbound API",
                "IsCorrect": false
            },
            {
                "Text": "Northbound API",
                "IsCorrect": true
            },
            {
                "Text": "Westbound API",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-017",
        "questionText": "Which of the following are valid command modes in Cisco IOS? (Select all that apply.)",
        "explanation": "Cisco IOS uses a hierarchical structure of command modes:\n\n- **User EXEC mode:** (`Router>`) - First mode after login, limited monitoring commands.\n- **Privileged EXEC mode:** (`Router#`) - Accessed by `enable`, allows extensive monitoring and access to configuration modes.\n- **Global Configuration mode:** (`Router(config)#`) - Accessed by `configure terminal`, for system-wide configurations.\n- **Interface Configuration mode:** (`Router(config-if)#`) - Accessed from global config for individual interface settings.\n\n**Router Configuration mode** is not a distinct standard mode; routing protocol configurations are typically done in sub-modes under global configuration mode (e.g., `Router(config-router)#`).",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "User EXEC mode",
                "IsCorrect": true
            },
            {
                "Text": "Privileged EXEC mode",
                "IsCorrect": true
            },
            {
                "Text": "Global Configuration mode",
                "IsCorrect": true
            },
            {
                "Text": "Interface Configuration mode",
                "IsCorrect": true
            },
            {
                "Text": "Router Configuration mode",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-021",
        "questionText": "What is one major advantage of using controller-based networking compared to traditional network architectures?",
        "explanation": "**Controller-based networking (SDN)** centralizes network management by abstracting the control plane into a central controller. This approach provides:\n\n- **Centralized management and policy enforcement:** A single controller manages and applies policies across the entire network, simplifying configuration and ensuring consistency.\n- **Increased agility:** Network changes can be made quickly and programmatically.\n- **Improved scalability:** Easier to manage larger networks.\n\nIn contrast, traditional networks rely on manual, device-by-device configuration, leading to distributed management and potentially inconsistent policies.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Increased manual configuration on each device",
                "IsCorrect": false
            },
            {
                "Text": "Centralized management and policy enforcement",
                "IsCorrect": true
            },
            {
                "Text": "Reduced need for network virtualization",
                "IsCorrect": false
            },
            {
                "Text": "Dependency on individual device configuration",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-033",
        "questionText": "Which of the following statements best define the concept of \"infrastructure as code\" as implemented by tools like Terraform? (Select all that apply.)",
        "explanation": "**Infrastructure as Code (IaC)** is a methodology for managing and provisioning IT infrastructure through machine-readable definition files, rather than physical hardware configuration or interactive configuration tools. Key aspects include:\n\n- **It allows administrators to manage infrastructure using code and version control.** (True) Infrastructure configurations are written as code (e.g., HCL for Terraform) and managed in systems like Git.\n- **It enables automated, repeatable deployments of network and cloud resources.** (True) Code-based definitions allow for consistent and rapid deployments across environments.\n- **It facilitates easy rollback of changes in case of errors.** (True) Because configurations are versioned, reverting to a previous stable state is straightforward.\n\n- IaC aims to *reduce* manual configuration, not require it (Option C is false).\n- IaC is fundamentally about *enabling automation*, not eliminating it (Option E is false).",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It allows administrators to manage infrastructure using code and version control.",
                "IsCorrect": true
            },
            {
                "Text": "It enables automated, repeatable deployments of network and cloud resources.",
                "IsCorrect": true
            },
            {
                "Text": "It requires manual configuration changes on each individual device.",
                "IsCorrect": false
            },
            {
                "Text": "It facilitates easy rollback of changes in case of errors.",
                "IsCorrect": true
            },
            {
                "Text": "It eliminates the need for network automation entirely.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-034",
        "questionText": "Which characteristic best defines the role of generative AI in network operations?",
        "explanation": "**Generative AI** in network operations is about creating new content, solutions, or configurations based on input requirements.\n\n- It **generates new network configurations and scripts based on high-level requirements**. For example, an engineer could specify a desired network segment, and generative AI could produce the necessary router/switch configurations.\n\n- **Predictive analytics** (Option A) forecasts future trends based on historical data, which is a different AI function.\n- Generative AI **augments** traditional management, it doesn't replace protocols (Option B).\n- It's not limited to just monitoring (Option C); it actively produces new outputs.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It analyzes historical data to predict future network trends.",
                "IsCorrect": false
            },
            {
                "Text": "It replaces traditional network management protocols entirely.",
                "IsCorrect": false
            },
            {
                "Text": "It solely monitors network performance without taking corrective actions.",
                "IsCorrect": false
            },
            {
                "Text": "It generates new network configurations and scripts based on high-level requirements.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-038",
        "questionText": "Which command on a Cisco IOS router is used to display detailed interface statistics, including error counters?",
        "explanation": "The `show interfaces` command on a Cisco IOS router provides comprehensive details about each network interface. This includes:\n\n- Physical status (up/down) and line protocol state.\n- Input and output packet/byte counts.\n- Various error counters such as **CRC errors, input errors, collisions, late collisions, runts, and giants**.\n\nThese error counters are crucial for troubleshooting physical layer issues (e.g., cabling problems, duplex mismatches) and assessing interface health.\n\n- `show ip interface` provides IP-specific information but not detailed error counters.\n- `show counters` and `show log` are not the standard commands for this specific type of detailed interface statistics.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "show interfaces",
                "IsCorrect": true
            },
            {
                "Text": "show ip interface",
                "IsCorrect": false
            },
            {
                "Text": "show counters",
                "IsCorrect": false
            },
            {
                "Text": "show log",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-043",
        "questionText": "Which of the following statements accurately describe the impact of automation on network management? (Select all that apply.)",
        "explanation": "Network automation uses software tools and scripting to configure and manage network devices with minimal manual intervention. Its impacts include:\n\n- **Automation reduces manual configuration errors by standardizing processes.** (True) Scripts and templates ensure consistent and error-free configurations.\n- **Automation speeds up network provisioning and deployment times.** (True) Tasks can be executed simultaneously across many devices, reducing deployment time.\n- **Automation improves consistency and repeatability in network configurations.** (True) Automated processes ensure configurations are applied identically every time.\n\n- Automation **does not completely eliminate the need for human oversight** (Option C is false); human engineers are still needed for design, strategy, and complex issue handling.\n- Automation typically **reduces operational costs** over time due to efficiency gains, despite initial investment (Option E is false).",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Automation reduces manual configuration errors by standardizing processes.",
                "IsCorrect": true
            },
            {
                "Text": "Automation speeds up network provisioning and deployment times.",
                "IsCorrect": true
            },
            {
                "Text": "Automation completely eliminates the need for human oversight in network operations.",
                "IsCorrect": false
            },
            {
                "Text": "Automation improves consistency and repeatability in network configurations.",
                "IsCorrect": true
            },
            {
                "Text": "Automation significantly increases operational costs due to high initial investments.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-044",
        "questionText": "What is the PRIMARY role of Cisco DNA Center in managing a wireless network?",
        "explanation": "**Cisco DNA Center** is a network management and automation platform. Its primary role in a wireless network is **centralized management and automation of the network, including Wireless LAN Controllers (WLCs) and access points (APs)**.\n\nDNA Center acts as the 'brain' to:\n- Simplify complex tasks and streamline operations.\n- Push configurations, policies, and updates to multiple WLCs simultaneously.\n- Provide network design, provisioning, and assurance capabilities.\n\nIt does not directly provide wireless access (that's APs), forward wireless traffic (that's WLCs and APs), or primarily handle client authentication (that's often RADIUS servers integrated with the WLCs).",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Providing wireless access to clients.",
                "IsCorrect": false
            },
            {
                "Text": "Centralized management and automation of the network, including WLCs.",
                "IsCorrect": true
            },
            {
                "Text": "Forwarding wireless traffic.",
                "IsCorrect": false
            },
            {
                "Text": "Wireless client authentication.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-047",
        "questionText": "Which of the following correctly distinguish between northbound and southbound APIs in an SDN architecture? (Select all that apply.)",
        "explanation": "In Software-Defined Networking (SDN), APIs define communication pathways:\n\n- **Northbound APIs:** Allow **higher-level applications, orchestration systems, or business platforms** to interact with the **SDN controller**. They provide an abstract view of the network and enable applications to query network state and define policies.\n- **Southbound APIs:** Facilitate communication between the **SDN controller** and the **network devices (switches, routers)**. They are used by the controller to push configurations, instructions, and gather device-level telemetry.\n\n- Northbound APIs **do not directly configure physical hardware** (Option C is false); that is the role of southbound APIs.\n- Southbound APIs are **not primarily used to expose network analytics to external applications** (Option D is false); that's typically done via northbound interfaces.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Northbound APIs allow communication from the SDN controller to higher-level applications and business systems.",
                "IsCorrect": true
            },
            {
                "Text": "Southbound APIs facilitate communication between the SDN controller and the network devices.",
                "IsCorrect": true
            },
            {
                "Text": "Northbound APIs are used to directly configure physical hardware.",
                "IsCorrect": false
            },
            {
                "Text": "Southbound APIs are used to expose network analytics to external applications.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-056",
        "questionText": "Which protocol is commonly used as a southbound API in SDN environments to communicate between the controller and network devices?",
        "explanation": "In Software-Defined Networking (SDN), APIs define communication interfaces between different layers:\n\n- **Southbound APIs** are used by the **SDN controller** to communicate with and push instructions/configurations to the underlying **network devices** (e.g., switches, routers). This decouples the control logic from hardware forwarding.\n- **OpenFlow** is the most well-known and widely adopted southbound API protocol that enables this communication.\n\n- **REST** and **NETCONF** are typically used as northbound APIs (for applications to communicate with the controller) or for device management, but not as the primary southbound protocol between controller and forwarding plane.\n- **SNMP** is a network management protocol, not an SDN southbound API.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "OpenFlow",
                "IsCorrect": true
            },
            {
                "Text": "REST",
                "IsCorrect": false
            },
            {
                "Text": "NETCONF",
                "IsCorrect": false
            },
            {
                "Text": "SNMP",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-059",
        "questionText": "Consider a scenario where a network administrator needs to implement redundancy and load balancing for web servers in a data center. They are using Cisco Application Delivery Controller (ADC) devices. Which of the following load balancing algorithms would be most suitable for ensuring that server load is distributed based on the current number of active connections each server is handling, directing new requests to the server with the fewest active connections?",
        "explanation": "Load balancing algorithms distribute incoming client requests across a pool of backend servers to optimize resource utilization and ensure high availability.\n\nThe algorithm most suitable for distributing load based on the **current number of active connections** is **Least Connections**.\n\n- **Least Connections:** This dynamic algorithm directs new requests to the server that currently has the *fewest active connections*. It actively monitors server load in real-time, aiming to keep server utilization balanced.\n- **Round Robin:** Distributes requests sequentially, ignoring server load or health.\n- **Weighted Round Robin:** Distributes requests based on pre-assigned weights, still ignoring dynamic load.\n- **Source IP Hash:** Directs requests from the same client IP to the same server for session persistence, not primarily for load distribution based on server load.",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Round Robin",
                "IsCorrect": false
            },
            {
                "Text": "Weighted Round Robin",
                "IsCorrect": false
            },
            {
                "Text": "Least Connections",
                "IsCorrect": true
            },
            {
                "Text": "Source IP Hash",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-061",
        "questionText": "Which of the following characteristics are commonly associated with REST-based APIs? (Select all that apply.)",
        "explanation": "**REST (Representational State Transfer) APIs** are a set of architectural principles for designing networked applications. Common characteristics include:\n\n- **They use HTTP verbs such as GET, POST, PUT, and DELETE for CRUD operations.** (True) GET for retrieve, POST for create, PUT for update/replace, DELETE for remove.\n- **They typically encode data using JSON or XML.** (True) JSON is the most prevalent due to its lightweight nature and readability.\n- **They support various authentication types, including Basic, Digest, and token-based methods.** (True) Authentication is handled independently of REST principles.\n\n- REST APIs are generally **stateless**, meaning each request from a client to a server contains all the information needed to understand the request, and the server does not store client context between requests (Option C is false).\n- REST APIs **do not require SOAP** for message formatting (Option E is false); SOAP is a separate, more rigid, XML-based protocol often seen as an alternative to REST.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "They use HTTP verbs such as GET, POST, PUT, and DELETE for CRUD operations",
                "IsCorrect": true
            },
            {
                "Text": "They typically encode data using JSON or XML",
                "IsCorrect": true
            },
            {
                "Text": "They enforce stateful interactions between the client and server.",
                "IsCorrect": false
            },
            {
                "Text": "They support various authentication types, including Basic, Digest, and token-based methods.",
                "IsCorrect": true
            },
            {
                "Text": "They require SOAP for message formatting.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-062",
        "questionText": "Which Cisco IOS command is used to assign a description to an interface?",
        "explanation": "In Cisco IOS, to add a descriptive label to a router or switch interface, the command used is simply `description`. This command is entered within the specific interface's configuration mode.\n\nSyntax: `interface <type><number>` then `description <text>`\n\nExample:\n```\nRouter(config)# interface GigabitEthernet0/1\nRouter(config-if)# description Uplink to Core Switch\n```\n\nThis description is for administrative purposes only and does not affect the interface's operational behavior.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "description",
                "IsCorrect": true
            },
            {
                "Text": "interface description",
                "IsCorrect": false
            },
            {
                "Text": "set description",
                "IsCorrect": false
            },
            {
                "Text": "ip description",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-064",
        "questionText": "Which command is used to save the running configuration to the startup configuration on a Cisco device?",
        "explanation": "In Cisco IOS, configuration changes made in **running configuration** (active in RAM) are lost upon reboot unless saved to **startup configuration** (stored in NVRAM).\n\nThe command to save these changes is `copy running-config startup-config`.\n\nAn older, but still common, alternative command that performs the same function is `write memory`.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "copy running-config startup-config",
                "IsCorrect": true
            },
            {
                "Text": "write memory",
                "IsCorrect": true
            },
            {
                "Text": "save config",
                "IsCorrect": false
            },
            {
                "Text": "commit",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-071",
        "questionText": "Which of the following are capabilities of configuration management tools such as Ansible and Terraform? (Select all that apply.)",
        "explanation": "Configuration management tools like Ansible and Terraform are key to Infrastructure as Code (IaC) and network automation:\n\n- **Automating the provisioning and configuration of network devices and infrastructure.** (True) They can deploy and configure resources at scale.\n- **Enforcing consistent configurations through version-controlled code.** (True) Configurations are defined in code, promoting consistency and allowing tracking of changes.\n- **Enabling infrastructure as code for reproducible deployments.** (True) They treat infrastructure as versioned code, ensuring deployments are consistent and repeatable.\n\n- Ansible is **agentless**, meaning it doesn't require agents on every managed device (Option C is false).\n- These tools are for **automation and management**, not direct interactive CLI access (Option E is false).",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Automating the provisioning and configuration of network devices and infrastructure.",
                "IsCorrect": true
            },
            {
                "Text": "Enforcing consistent configurations through version-controlled code.",
                "IsCorrect": true
            },
            {
                "Text": "Requiring agents on every managed device.",
                "IsCorrect": false
            },
            {
                "Text": "Enabling infrastructure as code for reproducible deployments.",
                "IsCorrect": true
            },
            {
                "Text": "Providing real-time, interactive CLI access to devices.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-079",
        "questionText": "Network automation and programmability have become essential for modern network management. Which of the following statements regarding these concepts are correct? (Select all that apply.)",
        "explanation": "Network automation and programmability transform network management by leveraging software and APIs:\n\n- **Network automation reduces the need for manual configuration and minimizes human error.** (True) By scripting tasks, consistency is improved and mistakes are reduced.\n- **Programmability allows network devices to be managed via APIs and software-defined methods.** (True) APIs (like REST, NETCONF) enable programmatic control, decoupling management from manual CLI.\n- **Automation improves network reliability and consistency by enforcing standardized configurations.** (True) Automated deployments ensure uniform configurations, which are easier to troubleshoot and more reliable.\n- **Automation and programmability include concepts such as Software-Defined Networking (SDN) and network orchestration.** (True) SDN centralizes control, and orchestration coordinates automated tasks across multiple systems.\n\n- Automation **does not eliminate the need for any human intervention** (Option D is false); human oversight, design, and handling of exceptions are still required.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Network automation reduces the need for manual configuration and minimizes human error.",
                "IsCorrect": true
            },
            {
                "Text": "Programmability allows network devices to be managed via APIs and software-defined methods.",
                "IsCorrect": true
            },
            {
                "Text": "Automation improves network reliability and consistency by enforcing standardized configurations.",
                "IsCorrect": true
            },
            {
                "Text": "Automation eliminates the need for any human intervention in network operations.",
                "IsCorrect": false
            },
            {
                "Text": "Automation and programmability include concepts such as Software-Defined Networking (SDN) and network orchestration.",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-081",
        "questionText": "Which of the following characteristics differentiate traditional networks from controller-based (software-defined) networking? (Select all that apply.)",
        "explanation": "Traditional networks and controller-based (SDN) networks differ significantly in their architecture and management:\n\n- **Traditional networks require manual configuration of individual devices.** (True) Each router and switch is configured separately.\n- **Controller-based networks centralize management through a controller.** (True) A central SDN controller orchestrates and manages the entire network.\n- **In traditional networks, the control plane is distributed across devices.** (True) Each device makes its own routing and forwarding decisions.\n- **Controller-based networks separate the control plane from the data plane.** (True) The controller handles decision-making (control plane), while devices only forward packets (data plane).\n\n- Traditional networks **do not inherently support API-driven, programmatic configuration** (Option E is false); this is a hallmark of SDN.",
        "difficulty": "3",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Traditional networks require manual configuration of individual devices.",
                "IsCorrect": true
            },
            {
                "Text": "Controller-based networks centralize management through a controller.",
                "IsCorrect": true
            },
            {
                "Text": "In traditional networks, the control plane is distributed across devices.",
                "IsCorrect": true
            },
            {
                "Text": "Controller-based networks separate the control plane from the data plane.",
                "IsCorrect": true
            },
            {
                "Text": "Traditional networks inherently support API-driven, programmatic configuration.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-084",
        "questionText": "Which of the following statements about AI (generative and predictive) and machine learning in network operations are true? (Select all that apply.)",
        "explanation": "AI (Artificial Intelligence) and machine learning (ML) are transforming network operations:\n\n- **Predictive analytics can forecast network failures and performance bottlenecks.** (True) ML models analyze historical data to predict future events.\n- **Generative AI can automatically create network configuration scripts based on high-level policies.** (True) Generative models can produce new content, like code, from defined requirements.\n- **Machine learning algorithms can analyze network traffic patterns to detect anomalies.** (True) ML excels at identifying unusual behavior that may indicate threats or performance issues.\n\n- AI **does not completely replace the role of human network engineers** (Option D is false); it automates routine tasks and provides insights, but human expertise remains crucial for complex problem-solving, design, and decision-making.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Predictive analytics can forecast network failures and performance bottlenecks.",
                "IsCorrect": true
            },
            {
                "Text": "Generative AI can automatically create network configuration scripts based on high-level policies.",
                "IsCorrect": true
            },
            {
                "Text": "Machine learning algorithms can analyze network traffic patterns to detect anomalies.",
                "IsCorrect": true
            },
            {
                "Text": "AI completely replaces the role of human network engineers.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-085",
        "questionText": "Which of the following protocols are commonly used for managing Cisco switches? (Select all that apply.)",
        "explanation": "Common protocols used for managing Cisco switches include:\n\n- **Telnet:** For remote command-line interface (CLI) access, but it's insecure as it sends data in plaintext.\n- **SSH (Secure Shell):** The secure alternative to Telnet, providing encrypted CLI access.\n- **SNMP (Simple Network Management Protocol):** For network monitoring and management, allowing NMS to collect device information. SNMPv3 offers security features.\n- **HTTP/HTTPS:** For accessing web-based graphical user interfaces (GUIs) for device management. HTTPS provides encryption for secure access.\n\n- **FTP (File Transfer Protocol)** is primarily for file transfer and is not typically used for interactive real-time management or configuration of devices.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Telnet",
                "IsCorrect": true
            },
            {
                "Text": "SSH",
                "IsCorrect": true
            },
            {
                "Text": "SNMP",
                "IsCorrect": true
            },
            {
                "Text": "HTTP/HTTPS",
                "IsCorrect": true
            },
            {
                "Text": "FTP",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-088",
        "questionText": "What is the primary benefit of separating the control plane from the data plane in network devices?",
        "explanation": "Separating the control plane from the data plane is a fundamental principle of Software-Defined Networking (SDN).\n\n- **Control Plane:** Responsible for network intelligence, decision-making (e.g., routing tables, forwarding policies).\n- **Data Plane (or Forwarding Plane):** Responsible for the actual forwarding of packets based on instructions from the control plane.\n\nIn SDN, the control plane is *decoupled* from individual network devices and **centralized in an SDN controller**.\n\n- The primary benefit of this separation is **centralized decision-making, enabling more efficient and scalable network management** (Option B).\n- This allows for a global view of the network, simplifies policy enforcement, enables automation, and enhances network agility.\n\n- It does not necessarily lead to faster packet forwarding by combining functions on a single chip (Option A often refers to traditional integrated designs).\n- It doesn't primarily reduce the number of interfaces (Option C) or improve physical security (Option D).",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "It allows for faster packet forwarding by combining both functions on a single chip.",
                "IsCorrect": false
            },
            {
                "Text": "It centralizes decision-making, enabling more efficient and scalable network management.",
                "IsCorrect": true
            },
            {
                "Text": "It reduces the number of interfaces required on a network device.",
                "IsCorrect": false
            },
            {
                "Text": "It improves the physical security of network devices.",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-090",
        "questionText": "What term describes the virtual network layer built on top of the physical infrastructure in SDN architectures?",
        "explanation": "In Software-Defined Networking (SDN) architectures, the network is often conceptualized in two main layers:\n\n- **Underlay Network:** The physical infrastructure (routers, switches, cables) that provides the basic, physical connectivity.\n- **Overlay Network:** The **virtual network layer built on top of the physical underlay**. It provides logical segmentation and abstraction, allowing virtual networks to be created and managed independently of the physical hardware. This separation enables flexibility, rapid provisioning, and centralized control.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Underlay network",
                "IsCorrect": false
            },
            {
                "Text": "Overlay network",
                "IsCorrect": true
            },
            {
                "Text": "Control plane",
                "IsCorrect": false
            },
            {
                "Text": "Fabric network",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-106",
        "questionText": "Which of the following are common components or data types found in JSON-encoded data? (Select all that apply.)",
        "explanation": "JSON (JavaScript Object Notation) is a lightweight data-interchange format. Its core components and data types include:\n\n- **Key-value pairs:** Data is represented as pairs where a 'key' (string) is mapped to a 'value'.\n- **Arrays:** Ordered lists of values.\n- **Objects:** Unordered collections of key-value pairs (similar to dictionaries or hash maps).\n- **Strings:** Sequences of Unicode characters.\n\nOther basic data types include numbers (integers, floats) and booleans (true/false) and null.\n\n- JSON **does not natively support binary files**; binary data must be encoded (e.g., Base64) into a string format to be included in JSON.",
        "difficulty": "2",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "Key-value pairs",
                "IsCorrect": true
            },
            {
                "Text": "Arrays",
                "IsCorrect": true
            },
            {
                "Text": "Objects",
                "IsCorrect": true
            },
            {
                "Text": "Binary files",
                "IsCorrect": false
            },
            {
                "Text": "Strings",
                "IsCorrect": true
            }
        ],
        "cat": "AUTO"
    },
    {
        "questionId": "r-ccnaq-109",
        "questionText": "Which command is used on a Cisco device to display current CPU usage statistics?",
        "explanation": "To monitor the CPU utilization of a Cisco router or switch, the standard Cisco IOS command is `show processes cpu`.\n\nThis command provides:\n- Overall CPU utilization (e.g., 5-second, 1-minute, 5-minute averages).\n- Detailed CPU usage per running process.\n\nThis information is vital for performance monitoring and troubleshooting high CPU issues that can lead to network slowdowns or instability.",
        "difficulty": "1",
        "comments": "",
        "exhibits": [],
        "answerChoices": [
            {
                "Text": "show processes cpu",
                "IsCorrect": true
            },
            {
                "Text": "show cpu usage",
                "IsCorrect": false
            },
            {
                "Text": "show system performance",
                "IsCorrect": false
            },
            {
                "Text": "show process memory",
                "IsCorrect": false
            }
        ],
        "cat": "AUTO"
    }
]